[
  {
    "korean": "희망",
    "english": "Hope",
    "details_en": "The word '희망' (huimang) means 'hope' in Korean. It signifies the desire or expectation for a positive outcome in the future. Koreans often use this word to encourage others or express optimism during difficult times. Phrases like '희망을 잃지 마세요' (Don't lose hope) are commonly heard.",
    "details_ko": "단어 '희망'은 한국어로 'hope'를 의미합니다. 이는 미래에 대한 긍정적인 결과에 대한 바람이나 기대를 나타냅니다. 한국인들은 어려운 시기에도 서로를 격려하거나 낙관적인 태도를 표현할 때 이 단어를 자주 사용합니다. '희망을 잃지 마세요'와 같은 표현이 자주 사용됩니다."
  },
  {
    "korean": "평화",
    "english": "Peace",
    "details_en": "The word '평화' (pyeonghwa) translates to 'peace' in English. It refers to a state of tranquility, harmony, and absence of conflict. In Korean culture, peace is a valued ideal in both personal life and society. The term is commonly used in political and social contexts as well as in greetings like '평화로운 하루 되세요' (Have a peaceful day).",
    "details_ko": "단어 '평화'는 영어로 'peace'를 뜻합니다. 이는 고요함, 조화, 갈등의 부재를 의미합니다. 한국 문화에서 평화는 개인 생활과 사회 모두에서 중요한 이상으로 여겨집니다. 이 용어는 정치적, 사회적 맥락뿐만 아니라 '평화로운 하루 되세요'와 같은 인사에서도 자주 사용됩니다."
  },
  {
    "korean": "용기",
    "english": "Courage",
    "details_en": "The word '용기' (yonggi) means 'courage' or 'bravery' in Korean. It is used to describe the mental strength to face fear, danger, or difficulties. Koreans admire 용기 in both everyday acts and heroic deeds. The phrase '용기를 내세요' (Have courage) is often used to support someone.",
    "details_ko": "단어 '용기'는 한국어로 'courage' 또는 'bravery'를 의미합니다. 이는 두려움, 위험, 어려움을 마주하는 정신적 강인함을 나타냅니다. 한국인들은 일상적인 행동이나 영웅적인 행위에서 모두 용기를 높이 평가합니다. '용기를 내세요'라는 표현이 자주 사용됩니다."
  },
  {
    "korean": "꿈",
    "english": "Dream",
    "details_en": "The word '꿈' (kkum) means 'dream' in Korean. It can refer to dreams while sleeping or aspirations for the future. In Korean culture, dreams are often symbolic and meaningful. The phrase '꿈을 이루세요' (Achieve your dreams) encourages people to pursue their goals.",
    "details_ko": "단어 '꿈'은 한국어로 'dream'을 의미하며, 잠잘 때 꾸는 꿈이나 미래에 대한 포부를 나타낼 수 있습니다. 한국 문화에서 꿈은 상징적이고 의미 있는 것으로 여겨집니다. '꿈을 이루세요'와 같은 표현은 목표를 향해 나아가도록 격려합니다."
  },
  {
    "korean": "자유",
    "english": "Freedom",
    "details_en": "The word '자유' (jayu) translates to 'freedom' or 'liberty' in English. It represents the state of being free from restrictions or oppression. In Korea, 자유 is a core democratic value and also a personal aspiration. Expressions like '자유롭게 살아라' (Live freely) highlight its importance.",
    "details_ko": "단어 '자유'는 영어로 'freedom' 또는 'liberty'를 뜻합니다. 이는 억압이나 제한에서 벗어난 상태를 의미합니다. 한국에서 자유는 핵심적인 민주주의 가치이며, 개인적인 열망이기도 합니다. '자유롭게 살아라'와 같은 표현은 그 중요성을 강조합니다."
  },
  {
    "korean": "배움",
    "english": "Learning",
    "details_en": "The word '배움' (baeum) means 'learning' in Korean. It represents the act of acquiring knowledge or skills through study or experience. In Korean culture, lifelong learning is encouraged, and education is highly valued in both traditional and modern contexts.",
    "details_ko": "단어 '배움'은 한국어로 'learning'을 의미합니다. 이는 공부나 경험을 통해 지식이나 기술을 습득하는 행위를 나타냅니다. 한국 문화에서는 평생 학습이 장려되며, 교육은 전통적이든 현대적이든 매우 중요하게 여겨집니다."
  },
  {
    "korean": "기쁨",
    "english": "Joy",
    "details_en": "The word '기쁨' (gippeum) means 'joy' in Korean. It describes a feeling of great happiness or delight. Koreans often associate 기쁨 with celebrations, family moments, and personal achievements. Phrases like '기쁨을 나누다' (to share joy) are common.",
    "details_ko": "단어 '기쁨'은 한국어로 'joy'를 의미합니다. 이는 큰 행복이나 기쁨의 감정을 나타냅니다. 한국인들은 기쁨을 축하, 가족과의 시간, 개인의 성취와 연관 짓습니다. '기쁨을 나누다'와 같은 표현이 자주 사용됩니다."
  },
  {
    "korean": "존경",
    "english": "Respect",
    "details_en": "The word '존경' (jon-gyeong) translates to 'respect' in English. It signifies deep admiration and regard for someone’s qualities, achievements, or status. In Korea, 존경 is a fundamental part of relationships, especially toward elders and teachers.",
    "details_ko": "단어 '존경'은 영어로 'respect'를 뜻합니다. 이는 누군가의 자질, 성취 또는 지위에 대한 깊은 존경과 경외를 나타냅니다. 한국에서는 특히 어른이나 선생님에게 존경을 표현하는 것이 관계의 기본입니다."
  },
  {
    "korean": "도전",
    "english": "Challenge",
    "details_en": "The word '도전' (dojeon) means 'challenge' in Korean. It refers to taking on difficult tasks or stepping outside of one's comfort zone. Koreans use this word to encourage ambition and perseverance. '도전해 보세요' (Try the challenge) is a motivational phrase.",
    "details_ko": "단어 '도전'은 한국어로 'challenge'를 의미합니다. 이는 어려운 과제에 도전하거나 편안한 영역을 벗어나는 것을 의미합니다. 한국인들은 야망과 인내심을 북돋기 위해 이 단어를 자주 사용합니다. '도전해 보세요'는 대표적인 격려 표현입니다."
  },
  {
    "korean": "우정",
    "english": "Friendship",
    "details_en": "The word '우정' (ujeong) means 'friendship' in Korean. It emphasizes the emotional bond and trust between friends. Strong 우정 is often portrayed in Korean dramas and literature, highlighting loyalty and support.",
    "details_ko": "단어 '우정'은 한국어로 'friendship'을 의미합니다. 이는 친구 간의 정서적 유대와 신뢰를 강조합니다. 한국 드라마나 문학에서는 강한 우정을 충성심과 지지를 통해 자주 묘사합니다."
  },
  {
    "korean": "정직",
    "english": "Honesty",
    "details_en": "The word '정직' (jeongjik) means 'honesty' in Korean. It represents the quality of being truthful, sincere, and morally upright. Honesty is a highly respected virtue in Korean society, particularly in education, work, and interpersonal relationships.",
    "details_ko": "단어 '정직'은 한국어로 'honesty'를 의미합니다. 이는 진실하고 성실하며 도덕적으로 올바른 성품을 나타냅니다. 한국 사회에서 정직은 교육, 직장, 인간관계에서 매우 존중받는 덕목입니다."
  },
  {
    "korean": "사계절",
    "english": "Four Seasons",
    "details_en": "The word '사계절' (sagyejeol) means 'four seasons' in Korean. Korea experiences distinct spring, summer, autumn, and winter. The beauty of 사계절 is often appreciated in literature, music, and travel throughout the country.",
    "details_ko": "단어 '사계절'은 한국어로 'four seasons'를 의미합니다. 한국은 뚜렷한 봄, 여름, 가을, 겨울의 사계절을 경험합니다. 사계절의 아름다움은 문학, 음악, 여행 등에서 자주 찬양됩니다."
  },
  {
    "korean": "사랑해",
    "english": "I Love You",
    "details_en": "The phrase '사랑해' (saranghae) means 'I love you' in Korean. It is an informal and affectionate way to express love, commonly used among close couples, family, or friends. The more formal version is '사랑합니다'.",
    "details_ko": "'사랑해'는 한국어로 'I love you'를 의미하는 표현입니다. 이는 연인, 가족, 친구 사이에서 자주 쓰이는 친근하고 애정 어린 말입니다. 더 격식을 차린 표현은 '사랑합니다'입니다."
  },
  {
    "korean": "약속",
    "english": "Promise",
    "details_en": "The word '약속' (yaksok) translates to 'promise' in English. It refers to an agreement or commitment made between people. In Korean culture, keeping promises is considered a matter of integrity and respect.",
    "details_ko": "단어 '약속'은 영어로 'promise'를 뜻합니다. 이는 사람들 간에 이루어진 약속이나 다짐을 의미합니다. 한국 문화에서는 약속을 지키는 것이 신뢰와 존중의 문제로 여겨집니다."
  },
  {
    "korean": "추억",
    "english": "Memory",
    "details_en": "The word '추억' (chueok) means 'memory' in Korean, especially referring to fond or nostalgic memories. Koreans often share 추억 through photos, songs, and storytelling to relive meaningful moments.",
    "details_ko": "단어 '추억'은 한국어로 'memory'를 의미하며, 주로 소중하고 그리운 기억을 나타냅니다. 한국인들은 사진, 노래, 이야기 등을 통해 추억을 나누며 의미 있는 순간을 되새깁니다."
  }, 
  {
    "korean": "열정",
    "english": "Passion",
    "details_en": "The word '열정' (yeoljeong) means 'passion' in Korean. It represents strong enthusiasm or dedication toward something. Koreans admire 열정 in pursuits such as education, work, and hobbies.",
    "details_ko": "단어 '열정'은 한국어로 'passion'을 의미합니다. 이는 어떤 일에 대한 강한 열의나 헌신을 나타냅니다. 한국인들은 교육, 일, 취미 등에서 열정을 중요하게 생각합니다."
  },
  {
    "korean": "미소",
    "english": "Smile",
    "details_en": "The word '미소' (miso) means 'smile' in Korean. It conveys warmth, friendliness, and positivity. A genuine 미소 is seen as a sign of good character and kindness in Korean culture.",
    "details_ko": "단어 '미소'는 한국어로 'smile'을 의미합니다. 이는 따뜻함, 친근함, 긍정적인 감정을 전달합니다. 진심 어린 미소는 좋은 인성과 친절함의 표현으로 여겨집니다."
  },
  {
    "korean": "배려",
    "english": "Consideration",
    "details_en": "The word '배려' (baeryeo) means 'consideration' or 'thoughtfulness' in Korean. It emphasizes caring for others’ needs and feelings. It is an essential part of polite Korean behavior.",
    "details_ko": "단어 '배려'는 한국어로 'consideration' 또는 'thoughtfulness'를 의미합니다. 이는 타인의 필요와 감정을 배려하는 것을 강조합니다. 한국의 예절에서 중요한 요소입니다."
  },
  {
    "korean": "소망",
    "english": "Wish",
    "details_en": "The word '소망' (somang) translates to 'wish' or 'desire' in Korean. It represents a hope or aspiration for something meaningful. Koreans often express their 소망 during holidays or special occasions.",
    "details_ko": "단어 '소망'은 영어로 'wish' 또는 'desire'를 의미합니다. 이는 의미 있는 무언가를 바라는 희망을 나타냅니다. 한국인들은 명절이나 특별한 날에 소망을 자주 표현합니다."
  },
  {
    "korean": "기회",
    "english": "Opportunity",
    "details_en": "The word '기회' (gihoe) means 'opportunity' in Korean. It indicates a favorable time or chance to do something. In Korean society, taking and creating 기회 is encouraged for personal growth.",
    "details_ko": "단어 '기회'는 한국어로 'opportunity'를 의미합니다. 이는 무언가를 하기 좋은 시기나 기회를 뜻합니다. 한국 사회에서는 기회를 잡고 만드는 것이 개인 발전에 중요하다고 여겨집니다."
  }, 
  {
    "korean": "도움",
    "english": "Help",
    "details_en": "The word '도움' (doum) means 'help' or 'assistance' in Korean. It reflects the act of aiding someone in need. Expressions like '도와줄게요' (I'll help you) are common in daily life.",
    "details_ko": "단어 '도움'은 한국어로 'help' 또는 'assistance'를 의미합니다. 이는 도움이 필요한 사람을 돕는 행위를 나타냅니다. '도와줄게요'와 같은 표현이 일상에서 자주 사용됩니다."
  },
  {
    "korean": "평가",
    "english": "Evaluation",
    "details_en": "The word '평가' (pyeongga) means 'evaluation' in Korean. It is used in educational, professional, and social contexts to assess performance or value.",
    "details_ko": "단어 '평가'는 한국어로 'evaluation'을 의미합니다. 이는 교육, 직장, 사회적 맥락에서 성과나 가치를 평가할 때 사용됩니다."
  },
  {
    "korean": "기억",
    "english": "Memory",
    "details_en": "The word '기억' (gieok) means 'memory' in Korean. Unlike '추억', which is nostalgic, 기억 includes both recent and factual recollections. It is essential in learning and communication.",
    "details_ko": "단어 '기억'은 한국어로 'memory'를 의미합니다. '추억'이 향수를 담은 기억이라면, '기억'은 최근의 사실적 기억까지 포함합니다. 학습과 소통에서 중요한 역할을 합니다."
  },
  {
    "korean": "자신감",
    "english": "Confidence",
    "details_en": "The word '자신감' (jasingam) means 'confidence' in Korean. It refers to believing in oneself and one’s abilities. In Korea, 자신감 is encouraged in education and self-development.",
    "details_ko": "단어 '자신감'은 한국어로 'confidence'를 의미합니다. 이는 자신과 자신의 능력을 믿는 태도를 뜻합니다. 한국에서는 교육과 자기 계발에서 자신감을 강조합니다."
  },
  {
    "korean": "행운",
    "english": "Luck",
    "details_en": "The word '행운' (haengun) means 'luck' in Korean. It is associated with good fortune and positive outcomes. Phrases like '행운을 빌어요' (Good luck) are used to wish someone well.",
    "details_ko": "단어 '행운'은 한국어로 'luck'을 의미합니다. 이는 좋은 운과 긍정적인 결과와 관련이 있습니다. '행운을 빌어요'와 같은 표현으로 누군가에게 행운을 기원합니다."
  },
  {
    "korean": "여유",
    "english": "Leisure",
    "details_en": "The word '여유' (yeoyu) refers to having spare time or mental composure. It’s a valued aspect of Korean life, often sought after in the midst of a busy lifestyle.",
    "details_ko": "단어 '여유'는 한국어로 'leisure' 또는 '여유로움'을 의미하며, 시간적 혹은 정신적 여유를 말합니다. 바쁜 일상 속에서 여유는 중요한 삶의 요소로 여겨집니다."
  },
  {
    "korean": "소중함",
    "english": "Preciousness",
    "details_en": "The word '소중함' (sojungham) means 'preciousness' or 'importance' in Korean. It describes the deep value of people, relationships, or experiences.",
    "details_ko": "단어 '소중함'은 한국어로 'preciousness' 또는 '중요함'을 의미합니다. 이는 사람, 관계, 경험의 깊은 가치를 나타냅니다."
  },
  {
    "korean": "용서",
    "english": "Forgiveness",
    "details_en": "The word '용서' (yongseo) means 'forgiveness' in Korean. It refers to the act of letting go of resentment or anger. 용서는 인간관계에서 회복과 치유를 위한 중요한 요소입니다.",
    "details_ko": "단어 '용서'는 한국어로 'forgiveness'를 의미합니다. 이는 원망이나 분노를 놓아주는 행동을 말하며, 관계 회복과 치유를 위한 핵심 요소입니다."
  },
  {
    "korean": "신뢰",
    "english": "Trust",
    "details_en": "The word '신뢰' (sinroe) means 'trust' in Korean. It indicates confidence in someone’s character or reliability. Trust is a foundation in Korean families, friendships, and business relationships.",
    "details_ko": "단어 '신뢰'는 한국어로 'trust'를 의미합니다. 이는 누군가의 성품이나 신뢰성에 대한 확신을 뜻합니다. 신뢰는 가족, 우정, 비즈니스 관계의 기초입니다."
  },
  {
    "korean": "노력",
    "english": "Effort",
    "details_en": "The word '노력' (noryeok) means 'effort' in Korean. It signifies hard work and persistence to achieve something. Korean society places high value on 노력 in education and careers.",
    "details_ko": "단어 '노력'은 한국어로 'effort'를 의미합니다. 이는 어떤 것을 이루기 위한 노력과 끈기를 나타냅니다. 한국 사회에서는 교육과 경력에서 노력을 중요시합니다."
  },
  {
    "korean": "책임",
    "english": "Responsibility",
    "details_en": "The word '책임' (chaegim) means 'responsibility' in Korean. It refers to being accountable for actions or duties. Being responsible is considered a sign of maturity in Korea.",
    "details_ko": "단어 '책임'은 한국어로 'responsibility'를 의미합니다. 이는 행동이나 의무에 대해 책임지는 것을 의미합니다. 한국에서는 책임감 있는 태도를 성숙함의 표시로 여깁니다."
  },
  {
    "korean": "창의력",
    "english": "Creativity",
    "details_en": "The word '창의력' (chang-ui-ryeok) means 'creativity' in Korean. It describes the ability to think originally and inventively. Creativity is increasingly encouraged in modern Korean education and startups.",
    "details_ko": "단어 '창의력'은 한국어로 'creativity'를 의미합니다. 이는 독창적이고 창의적으로 생각하는 능력을 나타냅니다. 창의력은 현대 한국 교육과 스타트업에서 중요하게 여겨집니다."
  },
  {
    "korean": "존중",
    "english": "Respect",
    "details_en": "The word '존중' (jonjung) means 'respect' in Korean. It emphasizes acknowledging the worth and rights of others. In Korean etiquette, 존중 is fundamental to maintaining harmony.",
    "details_ko": "단어 '존중'은 한국어로 'respect'를 의미합니다. 이는 타인의 가치와 권리를 인정하는 태도를 강조합니다. 한국 예절에서 존중은 조화를 위한 기본 요소입니다."
  },
  {
    "korean": "성공",
    "english": "Success",
    "details_en": "The word '성공' (seonggong) means 'success' in Korean. It refers to achieving goals or favorable results. It is often linked to hard work, persistence, and opportunity.",
    "details_ko": "단어 '성공'은 한국어로 'success'를 의미합니다. 이는 목표 달성이나 좋은 결과를 얻는 것을 의미하며, 노력, 끈기, 기회와 밀접한 관련이 있습니다."
  },
  {
    "korean": "건강",
    "english": "Health",
    "details_en": "The word '건강' (geongang) means 'health' in Korean. It refers to the state of being physically and mentally well. Wishing others '건강하세요' (stay healthy) is a common and polite expression.",
    "details_ko": "단어 '건강'은 한국어로 'health'를 의미합니다. 이는 신체적, 정신적으로 건강한 상태를 뜻합니다. '건강하세요'는 자주 사용되는 예의 바른 인사입니다."
  },
  {
    "korean": "존엄",
    "english": "Dignity",
    "details_en": "The word '존엄' (joneom) means 'dignity' in Korean. It signifies the inherent worth and respect every person deserves. It is often used in legal, ethical, and human rights contexts.",
    "details_ko": "단어 '존엄'은 한국어로 'dignity'를 의미합니다. 이는 모든 사람이 지니는 고유한 존엄성과 존중을 나타냅니다. 법률, 윤리, 인권 등의 맥락에서 자주 사용됩니다."
  },
  {
    "korean": "미래",
    "english": "Future",
    "details_en": "The word '미래' (mirae) means 'future' in Korean. It refers to the time ahead and possibilities to come. Koreans often focus on planning and preparing for a better 미래.",
    "details_ko": "단어 '미래'는 한국어로 'future'를 의미합니다. 이는 앞으로의 시간과 다가올 가능성을 뜻합니다. 한국인들은 더 나은 미래를 위해 계획하고 준비하는 것을 중요하게 생각합니다."
  },
  {
    "korean": "희생",
    "english": "Sacrifice",
    "details_en": "The word '희생' (huisaeng) means 'sacrifice' in Korean. It refers to giving up something valuable for the benefit of others. 희생 is often honored in family and national contexts.",
    "details_ko": "단어 '희생'은 한국어로 'sacrifice'를 의미합니다. 이는 타인의 이익을 위해 자신의 소중한 것을 포기하는 행위를 말합니다. 가족과 국가적 맥락에서 희생은 높이 평가됩니다."
  },
  {
    "korean": "애정",
    "english": "Affection",
    "details_en": "The word '애정' (aejeong) means 'affection' in Korean. It expresses warm, loving feelings toward someone. 애정 is commonly used in both romantic and familial relationships.",
    "details_ko": "단어 '애정'은 한국어로 'affection'을 의미합니다. 이는 누군가에 대한 따뜻하고 사랑스러운 감정을 표현합니다. 연인이나 가족 간의 관계에서 자주 사용됩니다."
  },
  {
    "korean": "용서",
    "english": "Forgiveness",
    "details_en": "The word '용서' (yongseo) means 'forgiveness' in Korean. It represents letting go of anger and resentment. In Korean culture, 용서 is valued in personal growth and harmony.",
    "details_ko": "단어 '용서'는 한국어로 'forgiveness'를 의미합니다. 이는 분노와 원망을 내려놓는 것을 뜻합니다. 한국 문화에서는 용서를 개인의 성장과 조화의 가치로 여깁니다."
  },
  {
    "korean": "배고픔",
    "english": "Hunger",
    "details_en": "The word '배고픔' (baegopeum) means 'hunger' in Korean. It describes the physical need for food. It is often used in everyday conversation and humanitarian contexts.",
    "details_ko": "단어 '배고픔'은 한국어로 'hunger'를 의미합니다. 이는 음식에 대한 신체적인 욕구를 나타냅니다. 일상 대화나 인도주의적 맥락에서 자주 사용됩니다."
  },
  {
    "korean": "고요",
    "english": "Silence",
    "details_en": "The word '고요' (goyo) means 'silence' or 'tranquility' in Korean. It suggests peace and stillness, often associated with nature or meditation.",
    "details_ko": "단어 '고요'는 한국어로 'silence' 또는 'tranquility'를 의미합니다. 이는 평화롭고 조용한 상태를 나타내며, 자연이나 명상과 관련이 있습니다."
  },
  {
    "korean": "인내",
    "english": "Patience",
    "details_en": "The word '인내' (innae) means 'patience' in Korean. It refers to the ability to endure hardship without complaint. 인내 is seen as a virtue in Korean culture.",
    "details_ko": "단어 '인내'는 한국어로 'patience'를 의미합니다. 이는 불평 없이 어려움을 견디는 능력을 말합니다. 한국 문화에서 인내는 미덕으로 여겨집니다."
  },
  {
    "korean": "정",
    "english": "Emotional Bond",
    "details_en": "The word '정' (jeong) is a unique Korean concept referring to deep emotional connection and attachment. It often develops over time through shared experiences and care.",
    "details_ko": "단어 '정'은 한국 고유의 개념으로, 깊은 정서적 유대감과 애착을 의미합니다. 이는 함께한 시간과 배려를 통해 형성됩니다."
  },
  {
    "korean": "감동",
    "english": "Emotion",
    "details_en": "The word '감동' (gamdong) means 'emotion' or 'being moved' in Korean. It refers to a deep emotional response to something touching or inspiring. 감동 is commonly used in reaction to movies, music, or kind actions.",
    "details_ko": "단어 '감동'은 한국어로 'emotion' 또는 '감동받음'을 의미합니다. 이는 감동적이거나 영감을 주는 것에 대한 깊은 감정 반응을 나타냅니다. 영화, 음악, 친절한 행동 등에 자주 사용됩니다."
  },
  {
    "korean": "노래",
    "english": "Song",
    "details_en": "The word '노래' (norae) means 'song' in Korean. It is an essential part of Korean culture, from traditional folk music to modern K-pop. Singing is a popular hobby in Korea, especially at karaoke rooms called '노래방'.",
    "details_ko": "단어 '노래'는 한국어로 'song'을 의미합니다. 이는 전통 민요부터 현대 K-pop까지 한국 문화의 중요한 부분입니다. '노래방'이라 불리는 노래방에서 노래 부르기는 매우 인기 있는 취미입니다."
  },
  {
    "korean": "꿈꾸다",
    "english": "To Dream",
    "details_en": "The verb '꿈꾸다' (kkumkkuda) means 'to dream' in Korean. It can refer to both literal dreams during sleep and aspirations in life. People are encouraged to '꿈을 꾸세요' (dream big).",
    "details_ko": "동사 '꿈꾸다'는 한국어로 'to dream'을 의미합니다. 이는 잠자는 동안의 꿈이나 인생의 포부를 모두 포함합니다. '꿈을 꾸세요'는 자주 쓰이는 격려 표현입니다."
  },
  {
    "korean": "기분",
    "english": "Mood",
    "details_en": "The word '기분' (gibun) means 'mood' or 'feeling' in Korean. It describes a person's emotional state. Common expressions include '기분 좋아요' (I feel good) or '기분 나빠요' (I feel bad).",
    "details_ko": "단어 '기분'은 한국어로 'mood' 또는 'feeling'을 의미합니다. 이는 사람의 감정 상태를 나타냅니다. '기분 좋아요', '기분 나빠요'와 같은 표현이 자주 사용됩니다."
  },
  {
    "korean": "바람",
    "english": "Wind / Wish",
    "details_en": "The word '바람' (baram) means both 'wind' and 'wish' depending on context. As wind, it refers to the natural breeze. As a wish, it's often used metaphorically in poetry or daily hopes.",
    "details_ko": "단어 '바람'은 문맥에 따라 'wind' 또는 'wish'를 의미합니다. 바람으로서 자연의 바람을 뜻하며, 소망으로서 시나 일상적인 희망에서 은유적으로 사용됩니다."
  },
  {
    "korean": "소식",
    "english": "News",
    "details_en": "The word '소식' (sosik) means 'news' or 'information' in Korean. It refers to updates or communications about events or people. '좋은 소식 있어요?' (Any good news?) is a common question.",
    "details_ko": "단어 '소식'은 한국어로 'news' 또는 '정보'를 의미합니다. 이는 사건이나 사람들에 대한 소식을 의미합니다. '좋은 소식 있어요?'는 흔히 묻는 말입니다."
  },
  {
    "korean": "기적",
    "english": "Miracle",
    "details_en": "The word '기적' (gijeok) means 'miracle' in Korean. It refers to an extraordinary event that inspires awe. 기적 is used in both religious and everyday contexts to describe unexpected wonders.",
    "details_ko": "단어 '기적'은 한국어로 'miracle'을 의미합니다. 이는 경외심을 불러일으키는 특별한 사건을 말합니다. 종교적 맥락뿐 아니라 일상 속의 놀라운 일들을 설명할 때도 사용됩니다."
  },
  {
    "korean": "마음",
    "english": "Heart / Mind",
    "details_en": "The word '마음' (maeum) means 'heart' or 'mind' in Korean. It refers to feelings, emotions, and inner thoughts. It is a central concept in Korean expressions like '마음에 들어요' (I like it).",
    "details_ko": "단어 '마음'은 한국어로 'heart' 또는 'mind'를 의미하며, 감정과 내면의 생각을 포함합니다. '마음에 들어요'와 같은 표현에서 자주 사용됩니다."
  },
  {
    "korean": "바쁘다",
    "english": "Busy",
    "details_en": "The word '바쁘다' (bappeuda) means 'busy' in Korean. It describes a state of having many tasks or obligations. '요즘 바쁘세요?' (Are you busy these days?) is a polite inquiry.",
    "details_ko": "단어 '바쁘다'는 한국어로 'busy'를 의미합니다. 이는 많은 일이나 약속이 있는 상태를 나타냅니다. '요즘 바쁘세요?'는 예의 있는 질문입니다."
  },
  {
    "korean": "배우다",
    "english": "To Learn",
    "details_en": "The verb '배우다' (baeuda) means 'to learn' in Korean. It represents the process of gaining knowledge or skills. It is widely used in school and life-related contexts.",
    "details_ko": "동사 '배우다'는 한국어로 'to learn'을 의미합니다. 이는 지식이나 기술을 습득하는 과정을 나타냅니다. 학교나 일상생활에서 자주 쓰입니다."
  },
  {
    "korean": "시간",
    "english": "Time",
    "details_en": "The word '시간' (sigan) means 'time' in Korean. It refers to the measurable period in which events occur. It's commonly used in schedules, daily life, and philosophical discussions.",
    "details_ko": "단어 '시간'은 한국어로 'time'을 의미합니다. 이는 사건이 일어나는 측정 가능한 기간을 나타냅니다. 일정, 일상생활, 철학적 논의에서 자주 사용됩니다."
  },
  {
    "korean": "계절",
    "english": "Season",
    "details_en": "The word '계절' (gyejeol) means 'season' in Korean. Korea has four distinct seasons: spring, summer, fall, and winter. The changing 계절 is deeply reflected in Korean food, fashion, and festivals.",
    "details_ko": "단어 '계절'은 한국어로 'season'을 의미합니다. 한국에는 봄, 여름, 가을, 겨울 네 계절이 뚜렷하게 있습니다. 변화하는 계절은 음식, 패션, 축제에 깊이 반영됩니다."
  },
  {
    "korean": "소리",
    "english": "Sound",
    "details_en": "The word '소리' (sori) means 'sound' in Korean. It refers to anything that can be heard. 소리 is an essential concept in music, nature, and communication.",
    "details_ko": "단어 '소리'는 한국어로 'sound'를 의미합니다. 이는 들을 수 있는 모든 것을 포함합니다. 음악, 자연, 의사소통에서 중요한 개념입니다."
  },
  {
    "korean": "하늘",
    "english": "Sky",
    "details_en": "The word '하늘' (haneul) means 'sky' in Korean. It symbolizes openness, hope, and vastness. In literature and daily life, 하늘 is often used poetically.",
    "details_ko": "단어 '하늘'은 한국어로 'sky'를 의미합니다. 이는 개방감, 희망, 광활함을 상징합니다. 문학이나 일상에서 시적으로 자주 사용됩니다."
  },
  {
    "korean": "달",
    "english": "Moon",
    "details_en": "The word '달' (dal) means 'moon' in Korean. It holds cultural and poetic significance and is linked to many traditional festivals like Chuseok.",
    "details_ko": "단어 '달'은 한국어로 'moon'을 의미합니다. 이는 문화적, 시적 의미를 가지며 추석 같은 전통 명절과 관련되어 있습니다."
  },
  {
    "korean": "별",
    "english": "Star",
    "details_en": "The word '별' (byeol) means 'star' in Korean. Stars often symbolize dreams, destiny, and beauty in Korean art and songs.",
    "details_ko": "단어 '별'은 한국어로 'star'를 의미합니다. 별은 꿈, 운명, 아름다움의 상징으로 예술과 노래에서 자주 등장합니다."
  },
  {
    "korean": "산",
    "english": "Mountain",
    "details_en": "The word '산' (san) means 'mountain' in Korean. Korea is known for its many scenic mountains, and hiking is a beloved national pastime.",
    "details_ko": "단어 '산'은 한국어로 'mountain'을 의미합니다. 한국은 많은 아름다운 산으로 유명하며, 등산은 인기 있는 국민 취미입니다."
  },
  {
    "korean": "바다",
    "english": "Sea",
    "details_en": "The word '바다' (bada) means 'sea' or 'ocean' in Korean. It represents depth, freedom, and calmness and appears often in Korean literature and travel.",
    "details_ko": "단어 '바다'는 한국어로 'sea' 또는 'ocean'을 의미합니다. 이는 깊이, 자유, 평온함을 상징하며 문학과 여행에서 자주 다뤄집니다."
  },
  {
    "korean": "비",
    "english": "Rain",
    "details_en": "The word '비' (bi) means 'rain' in Korean. Rain is often portrayed with emotional undertones in Korean songs and films.",
    "details_ko": "단어 '비'는 한국어로 'rain'을 의미합니다. 비는 한국 노래나 영화에서 감성적으로 자주 묘사됩니다."
  },
  {
    "korean": "눈",
    "english": "Snow / Eye",
    "details_en": "The word '눈' (nun) means both 'snow' and 'eye' in Korean, depending on context. It’s a beautiful example of Korean homonyms.",
    "details_ko": "단어 '눈'은 문맥에 따라 'snow' 또는 'eye'를 의미합니다. 이는 한국어 동음이의어의 좋은 예입니다."
  },
  {
    "korean": "빛",
    "english": "Light",
    "details_en": "The word '빛' (bit) means 'light' in Korean. It represents brightness, hope, and clarity. In literature, 빛 often symbolizes truth and enlightenment.",
    "details_ko": "단어 '빛'은 한국어로 'light'을 의미합니다. 이는 밝음, 희망, 명확함을 상징합니다. 문학에서는 진리와 깨달음의 상징으로 자주 사용됩니다."
  },
  {
    "korean": "그림자",
    "english": "Shadow",
    "details_en": "The word '그림자' (geurimja) means 'shadow' in Korean. It can denote literal darkness or emotional depth and mystery.",
    "details_ko": "단어 '그림자'는 한국어로 'shadow'를 의미합니다. 이는 물리적인 어둠뿐 아니라 감정적인 깊이나 신비함을 나타낼 수 있습니다."
  },
  {
    "korean": "향기",
    "english": "Fragrance",
    "details_en": "The word '향기' (hyanggi) means 'fragrance' or 'scent' in Korean. It is often used to describe flowers, perfumes, or even pleasant memories.",
    "details_ko": "단어 '향기'는 한국어로 'fragrance' 또는 'scent'를 의미합니다. 이는 꽃, 향수, 기분 좋은 추억 등을 묘사할 때 자주 사용됩니다."
  },
  {
    "korean": "온기",
    "english": "Warmth",
    "details_en": "The word '온기' (ongi) means 'warmth' in Korean. It refers to physical warmth as well as emotional warmth from people or moments.",
    "details_ko": "단어 '온기'는 한국어로 'warmth'를 의미합니다. 이는 신체적 따뜻함뿐 아니라 사람이나 순간에서 오는 감정적인 따뜻함도 포함합니다."
  },
  {
    "korean": "침묵",
    "english": "Silence",
    "details_en": "The word '침묵' (chimmuk) means 'silence' in Korean. It suggests intentional quietness and is often seen as powerful or respectful.",
    "details_ko": "단어 '침묵'은 한국어로 'silence'를 의미합니다. 이는 의도된 조용함을 뜻하며, 강력하거나 존중의 표현으로 여겨지기도 합니다."
  },
  {
    "korean": "여유",
    "english": "Relaxation",
    "details_en": "The word '여유' (yeoyu) means 'relaxation' or 'leisure' in Korean. It refers to having free time, mental space, or a calm attitude.",
    "details_ko": "단어 '여유'는 한국어로 'relaxation' 또는 'leisure'를 의미합니다. 이는 여유로운 시간, 마음의 여유, 또는 침착한 태도를 나타냅니다."
  },
  {
    "korean": "기억",
    "english": "Memory",
    "details_en": "The word '기억' (gieok) means 'memory' in Korean. It refers to the act of remembering or the memories themselves. It holds emotional significance in relationships and history.",
    "details_ko": "단어 '기억'은 한국어로 'memory'를 의미합니다. 이는 기억하는 행위 또는 그 기억 자체를 뜻하며, 관계나 역사에서 감정적으로 중요한 의미를 가집니다."
  },
  {
    "korean": "희망",
    "english": "Hope",
    "details_en": "The word '희망' (huimang) means 'hope' in Korean. It symbolizes belief in positive outcomes and is often used in encouragement and motivation.",
    "details_ko": "단어 '희망'은 한국어로 'hope'를 의미합니다. 이는 긍정적인 결과를 믿는 것을 상징하며, 격려와 동기부여에 자주 사용됩니다."
  },
  {
    "korean": "두려움",
    "english": "Fear",
    "details_en": "The word '두려움' (duryeoum) means 'fear' in Korean. It describes the emotion of being afraid or anxious and is often explored in both personal and cultural contexts.",
    "details_ko": "단어 '두려움'은 한국어로 'fear'를 의미합니다. 이는 무섭거나 불안한 감정을 설명하며, 개인적 및 문화적 맥락에서 자주 다뤄집니다."
  },
  {
    "korean": "용기",
    "english": "Courage",
    "details_en": "The word '용기' (yonggi) means 'courage' in Korean. It is the strength to face fear, difficulty, or uncertainty. 용기 is praised in stories and daily life.",
    "details_ko": "단어 '용기'는 한국어로 'courage'를 의미합니다. 이는 두려움, 어려움, 불확실함을 마주하는 용기를 뜻하며, 이야기나 일상에서 높이 평가됩니다."
  },
  {
    "korean": "인내",
    "english": "Patience",
    "details_en": "The word '인내' (innae) means 'patience' in Korean. It reflects the ability to endure difficulty calmly and without complaint. Often seen as a virtue in Korean culture.",
    "details_ko": "단어 '인내'는 한국어로 'patience'를 의미합니다. 이는 어려움을 차분히 참고 견디는 능력을 뜻하며, 한국 문화에서 미덕으로 여겨집니다."
  },
  {
    "korean": "정직",
    "english": "Honesty",
    "details_en": "The word '정직' (jeongjik) means 'honesty' in Korean. It refers to truthfulness and integrity, valued highly in Korean society.",
    "details_ko": "단어 '정직'은 한국어로 'honesty'를 의미합니다. 이는 진실성과 정직함을 뜻하며, 한국 사회에서 매우 중요한 가치로 여겨집니다."
  },
  {
    "korean": "배려",
    "english": "Consideration",
    "details_en": "The word '배려' (baeryeo) means 'consideration' or 'thoughtfulness' in Korean. It emphasizes caring for others' feelings and needs.",
    "details_ko": "단어 '배려'는 한국어로 'consideration' 또는 'thoughtfulness'를 의미합니다. 이는 다른 사람의 감정과 필요를 배려하는 것을 강조합니다."
  },
  {
    "korean": "존경",
    "english": "Respect",
    "details_en": "The word '존경' (jon-gyeong) means 'respect' in Korean. It is used to express admiration or esteem, particularly for elders or role models.",
    "details_ko": "단어 '존경'은 한국어로 'respect'를 의미합니다. 이는 특히 어른이나 롤모델에 대한 존중과 존경을 표현하는 데 사용됩니다."
  },
  {
    "korean": "자유",
    "english": "Freedom",
    "details_en": "The word '자유' (jayu) means 'freedom' in Korean. It denotes the state of being free from restrictions or oppression, a cherished concept in personal and national identity.",
    "details_ko": "단어 '자유'는 한국어로 'freedom'을 의미합니다. 이는 억압이나 제한으로부터의 자유로운 상태를 뜻하며, 개인과 국가 정체성에서 소중한 개념입니다."
  },
  {
    "korean": "평화",
    "english": "Peace",
    "details_en": "The word '평화' (pyeonghwa) means 'peace' in Korean. It signifies tranquility, absence of conflict, and harmony, often used in both political and personal contexts.",
    "details_ko": "단어 '평화'는 한국어로 'peace'를 의미합니다. 이는 평온함, 갈등 없는 상태, 조화를 뜻하며 정치적, 개인적 맥락에서 모두 사용됩니다."
  },
  {
    "korean": "행운",
    "english": "Luck",
    "details_en": "The word '행운' (haengun) means 'luck' or 'fortune' in Korean. It is often used in wishes and blessings, like '행운을 빕니다!' (I wish you good luck!).",
    "details_ko": "단어 '행운'은 한국어로 'luck' 또는 'fortune'을 의미합니다. 이는 '행운을 빕니다!'와 같이 기원이나 축복에서 자주 사용됩니다."
  },
  {
    "korean": "진실",
    "english": "Truth",
    "details_en": "The word '진실' (jinsil) means 'truth' in Korean. It refers to factual accuracy and sincerity. 진실 is considered a moral and philosophical value.",
    "details_ko": "단어 '진실'은 한국어로 'truth'를 의미합니다. 이는 사실의 정확성과 성실함을 나타내며 도덕적, 철학적 가치로 여겨집니다."
  },
  {
    "korean": "기회",
    "english": "Opportunity",
    "details_en": "The word '기회' (gihoe) means 'opportunity' in Korean. It refers to a favorable moment or chance to do something. It is often tied to success and personal growth.",
    "details_ko": "단어 '기회'는 한국어로 'opportunity'를 의미합니다. 이는 어떤 일을 하기 좋은 순간이나 기회를 뜻하며, 성공과 개인적 성장과 관련이 있습니다."
  },
  {
    "korean": "성장",
    "english": "Growth",
    "details_en": "The word '성장' (seongjang) means 'growth' in Korean. It refers to development physically, mentally, or emotionally. It is a core concept in education and personal improvement.",
    "details_ko": "단어 '성장'은 한국어로 'growth'를 의미합니다. 이는 신체적, 정신적, 감정적 성장을 포함하며, 교육과 자기계발에서 중요한 개념입니다."
  },
  {
    "korean": "목표",
    "english": "Goal",
    "details_en": "The word '목표' (mokpyo) means 'goal' or 'target' in Korean. It refers to an aim or desired result. Setting 목표 is considered essential for success and motivation.",
    "details_ko": "단어 '목표'는 한국어로 'goal' 또는 'target'을 의미합니다. 이는 바라는 결과나 목적을 나타내며, 성공과 동기 부여에 필수적인 것으로 여겨집니다."
  },
  {
    "korean": "노력",
    "english": "Effort",
    "details_en": "The word '노력' (noryeok) means 'effort' in Korean. It denotes hard work and persistence toward achieving something, often praised in Korean culture.",
    "details_ko": "단어 '노력'은 한국어로 'effort'를 의미합니다. 이는 무언가를 이루기 위한 노력과 끈기를 의미하며, 한국 문화에서 높이 평가됩니다."
  },
  {
    "korean": "열정",
    "english": "Passion",
    "details_en": "The word '열정' (yeoljeong) means 'passion' in Korean. It refers to strong enthusiasm or desire, especially for a cause or activity.",
    "details_ko": "단어 '열정'은 한국어로 'passion'을 의미합니다. 이는 어떤 일이나 목표에 대한 강한 열의와 열망을 뜻합니다."
  },
  {
    "korean": "지혜",
    "english": "Wisdom",
    "details_en": "The word '지혜' (jihoe) means 'wisdom' in Korean. It signifies deep understanding, knowledge, and good judgment.",
    "details_ko": "단어 '지혜'는 한국어로 'wisdom'을 의미합니다. 이는 깊은 이해, 지식, 올바른 판단력을 나타냅니다."
  },
  {
    "korean": "꿈",
    "english": "Dream",
    "details_en": "The word '꿈' (kkum) means 'dream' in Korean. It can refer to dreams during sleep or aspirations and goals.",
    "details_ko": "단어 '꿈'은 한국어로 'dream'을 의미합니다. 이는 잠을 잘 때 꾸는 꿈이나 인생의 목표와 희망을 의미합니다."
  },
  {
    "korean": "사랑하다",
    "english": "To Love",
    "details_en": "The verb '사랑하다' (saranghada) means 'to love' in Korean. It is the active form of expressing love or deep affection toward someone.",
    "details_ko": "동사 '사랑하다'는 한국어로 'to love'를 의미합니다. 이는 누군가에게 깊은 애정을 표현하는 행동입니다."
  },
  {
    "korean": "배우다",
    "english": "To Learn",
    "details_en": "The verb '배우다' (baeuda) means 'to learn' in Korean. It refers to acquiring knowledge or skills through study or experience.",
    "details_ko": "동사 '배우다'는 한국어로 'to learn'을 의미합니다. 이는 공부나 경험을 통해 지식이나 기술을 익히는 것을 뜻합니다."
  },
  {
    "korean": "도전",
    "english": "Challenge",
    "details_en": "The word '도전' (dojeon) means 'challenge' in Korean. It refers to facing something difficult and trying to overcome it.",
    "details_ko": "단어 '도전'은 한국어로 'challenge'를 의미합니다. 이는 어려운 일에 맞서고 그것을 극복하려는 시도를 말합니다."
  },
  {
    "korean": "용서",
    "english": "Forgiveness",
    "details_en": "The word '용서' (yongseo) means 'forgiveness' in Korean. It represents the act of forgiving someone and letting go of resentment.",
    "details_ko": "단어 '용서'는 한국어로 'forgiveness'를 의미합니다. 이는 누군가를 용서하고 원한을 내려놓는 행위를 뜻합니다."
  },
  {
    "korean": "약속",
    "english": "Promise",
    "details_en": "The word '약속' (yaksok) means 'promise' in Korean. It denotes an agreement or commitment between people.",
    "details_ko": "단어 '약속'은 한국어로 'promise'를 의미합니다. 이는 사람들 사이의 약정이나 다짐을 나타냅니다."
  },
  {
    "korean": "인연",
    "english": "Connection",
    "details_en": "The word '인연' (inyeon) means 'connection' or 'fate' in Korean. It implies a destined relationship or meeting between people.",
    "details_ko": "단어 '인연'은 한국어로 'connection' 또는 'fate'를 의미합니다. 이는 사람들 간의 운명적인 인연이나 만남을 뜻합니다."
  },
  {
    "korean": "운명",
    "english": "Destiny",
    "details_en": "The word '운명' (unmyeong) means 'destiny' or 'fate' in Korean. It refers to the belief that certain events are meant to happen.",
    "details_ko": "단어 '운명'은 한국어로 'destiny' 또는 'fate'를 의미합니다. 이는 특정한 일이 일어나도록 정해졌다는 믿음을 나타냅니다."
  },
  {
    "korean": "관계",
    "english": "Relationship",
    "details_en": "The word '관계' (gwangye) means 'relationship' in Korean. It is used to describe connections between people, such as friendships, romantic ties, or professional links.",
    "details_ko": "단어 '관계'는 한국어로 'relationship'을 의미합니다. 이는 친구, 연인, 직장 등 사람들 간의 다양한 관계를 설명하는 데 사용됩니다."
  },
  {
    "korean": "믿음",
    "english": "Faith",
    "details_en": "The word '믿음' (mideum) means 'faith' or 'trust' in Korean. It implies belief in someone or something, often beyond proof.",
    "details_ko": "단어 '믿음'은 한국어로 'faith' 또는 'trust'를 의미합니다. 이는 증거 없이도 누군가나 무언가를 믿는 마음을 뜻합니다."
  },
  {
    "korean": "사과",
    "english": "Apology / Apple",
    "details_en": "The word '사과' (sagwa) means both 'apology' and 'apple' in Korean, depending on context. It's a classic example of homonyms in the language.",
    "details_ko": "단어 '사과'는 문맥에 따라 'apology' 또는 'apple'을 의미합니다. 이는 한국어의 대표적인 동음이의어 중 하나입니다."
  },
  {
    "korean": "선물",
    "english": "Gift",
    "details_en": "The word '선물' (seonmul) means 'gift' or 'present' in Korean. Giving 선물 is a common practice to express gratitude or celebration.",
    "details_ko": "단어 '선물'은 한국어로 'gift' 또는 'present'를 의미합니다. 선물은 감사나 축하의 표현으로 자주 사용됩니다."
  },
  {
    "korean": "행동",
    "english": "Action",
    "details_en": "The word '행동' (haengdong) means 'action' or 'behavior' in Korean. It refers to what someone does or how they act in various situations.",
    "details_ko": "단어 '행동'은 한국어로 'action' 또는 'behavior'를 의미합니다. 이는 어떤 상황에서 사람이 하는 행위나 태도를 뜻합니다."
  },
  {
    "korean": "결정",
    "english": "Decision",
    "details_en": "The word '결정' (gyeoljeong) means 'decision' in Korean. It refers to making a choice after considering different possibilities.",
    "details_ko": "단어 '결정'은 한국어로 'decision'을 의미합니다. 이는 여러 가능성을 고려한 후 선택을 내리는 행위를 뜻합니다."
  },
  {
    "korean": "변화",
    "english": "Change",
    "details_en": "The word '변화' (byeonhwa) means 'change' in Korean. It refers to transformation or alteration in condition, appearance, or situation.",
    "details_ko": "단어 '변화'는 한국어로 'change'를 의미합니다. 이는 상태, 외모, 상황 등의 변화나 전환을 나타냅니다."
  },
  {
    "korean": "미래",
    "english": "Future",
    "details_en": "The word '미래' (mirae) means 'future' in Korean. It signifies time ahead and is often associated with dreams, goals, and possibilities.",
    "details_ko": "단어 '미래'는 한국어로 'future'를 의미합니다. 이는 앞으로의 시간을 뜻하며, 꿈, 목표, 가능성과 자주 연결됩니다."
  },
  {
    "korean": "현재",
    "english": "Present (time)",
    "details_en": "The word '현재' (hyeonjae) means 'present' or 'current time' in Korean. It refers to the moment that is happening now.",
    "details_ko": "단어 '현재'는 한국어로 'present' 또는 'current time'을 의미합니다. 이는 지금 이 순간을 나타냅니다."
  },
  {
    "korean": "과거",
    "english": "Past",
    "details_en": "The word '과거' (gwageo) means 'past' in Korean. It refers to times or events that have already occurred.",
    "details_ko": "단어 '과거'는 한국어로 'past'를 의미합니다. 이는 이미 일어난 시간이나 사건을 나타냅니다."
  },
  {
    "korean": "희망",
    "english": "Hope",
    "details_en": "The word '희망' (huimang) means 'hope' in Korean. It represents the feeling of expectation and desire for a positive future.",
    "details_ko": "단어 '희망'은 한국어로 'hope'를 의미합니다. 이는 밝은 미래에 대한 기대와 소망을 나타냅니다."
  },
  {
    "korean": "용기",
    "english": "Courage",
    "details_en": "The word '용기' (yonggi) means 'courage' in Korean. It is the mental strength to face fear, pain, or adversity bravely.",
    "details_ko": "단어 '용기'는 한국어로 'courage'를 의미합니다. 이는 두려움, 고통, 역경에 용감하게 맞서는 정신적 힘을 뜻합니다."
  },
  {
    "korean": "강",
    "english": "River",
    "details_en": "The word '강' (gang) means 'river' in Korean. Rivers play a significant role in Korean geography and history.",
    "details_ko": "단어 '강'은 한국어로 'river'를 의미합니다. 강은 한국의 지리와 역사에서 중요한 역할을 합니다."
  },
  {
    "korean": "꽃",
    "english": "Flower",
    "details_en": "The word '꽃' (kkot) means 'flower' in Korean. Flowers are widely appreciated in Korean festivals, art, and symbolism.",
    "details_ko": "단어 '꽃'은 한국어로 'flower'를 의미합니다. 꽃은 한국의 축제, 예술, 상징에서 널리 사랑받습니다."
  },
  {
    "korean": "불",
    "english": "Fire",
    "details_en": "The word '불' (bul) means 'fire' in Korean. It symbolizes energy, warmth, and sometimes danger or passion.",
    "details_ko": "단어 '불'은 한국어로 'fire'를 의미합니다. 이는 에너지, 따뜻함, 때로는 위험이나 열정을 상징합니다."
  },
  {
    "korean": "물",
    "english": "Water",
    "details_en": "The word '물' (mul) means 'water' in Korean. Water is essential for life and is associated with calmness and adaptability.",
    "details_ko": "단어 '물'은 한국어로 'water'를 의미합니다. 물은 생명 유지에 필수적이며 평온함과 유연함을 상징합니다."
  },
  {
    "korean": "하늘",
    "english": "Sky",
    "details_en": "The word '하늘' (haneul) means 'sky' in Korean. It is often used to represent freedom, vastness, and spirituality.",
    "details_ko": "단어 '하늘'은 한국어로 'sky'를 의미합니다. 이는 자유, 광활함, 영적인 의미를 상징합니다."
  },
  {
    "korean": "달",
    "english": "Moon",
    "details_en": "The word '달' (dal) means 'moon' in Korean. The moon is a common symbol in Korean poetry, folklore, and festivals.",
    "details_ko": "단어 '달'은 한국어로 'moon'을 의미합니다. 달은 한국의 시, 전통 이야기, 축제에서 자주 등장하는 상징입니다."
  },
  {
    "korean": "태양",
    "english": "Sun",
    "details_en": "The word '태양' (taeyang) means 'sun' in Korean. It symbolizes warmth, life, and energy in many cultural contexts.",
    "details_ko": "단어 '태양'은 한국어로 'sun'을 의미합니다. 이는 따뜻함, 생명, 에너지를 상징하는 단어입니다."
  },
  {
    "korean": "별",
    "english": "Star",
    "details_en": "The word '별' (byeol) means 'star' in Korean. Stars often symbolize dreams, guidance, and the vast universe.",
    "details_ko": "단어 '별'은 한국어로 'star'를 의미합니다. 별은 꿈, 길잡이, 광대한 우주를 상징합니다."
  },
  {
    "korean": "빛",
    "english": "Light",
    "details_en": "The word '빛' (bit) means 'light' in Korean. It is used both literally and metaphorically to represent brightness, hope, and clarity.",
    "details_ko": "단어 '빛'은 한국어로 'light'를 의미합니다. 이는 밝음, 희망, 명확함을 상징적으로 표현할 때도 사용됩니다."
  },
  {
    "korean": "그림자",
    "english": "Shadow",
    "details_en": "The word '그림자' (geurimja) means 'shadow' in Korean. It represents darkness, mystery, or a hidden aspect.",
    "details_ko": "단어 '그림자'는 한국어로 'shadow'를 의미합니다. 이는 어둠, 신비, 숨겨진 측면을 나타냅니다."
  },
  {
    "korean": "소리",
    "english": "Sound",
    "details_en": "The word '소리' (sori) means 'sound' in Korean. It refers to audible vibrations and is important in music, communication, and nature.",
    "details_ko": "단어 '소리'는 한국어로 'sound'를 의미합니다. 이는 음악, 소통, 자연 속에서 중요한 역할을 합니다."
  },
  {
    "korean": "노래",
    "english": "Song",
    "details_en": "The word '노래' (norae) means 'song' in Korean. Songs are a key part of Korean culture, especially in K-pop and traditional music.",
    "details_ko": "단어 '노래'는 한국어로 'song'을 의미합니다. 노래는 특히 K-pop과 전통 음악에서 중요한 문화 요소입니다."
  },
  {
    "korean": "춤",
    "english": "Dance",
    "details_en": "The word '춤' (chum) means 'dance' in Korean. Dance is a form of expression and celebration in Korean tradition and modern performances.",
    "details_ko": "단어 '춤'은 한국어로 'dance'를 의미합니다. 이는 한국의 전통과 현대 공연에서 표현과 축하의 한 형태입니다."
  },
  {
    "korean": "이야기",
    "english": "Story",
    "details_en": "The word '이야기' (iyagi) means 'story' or 'tale' in Korean. It is used in daily conversation and literature to share experiences or imaginations.",
    "details_ko": "단어 '이야기'는 한국어로 'story' 또는 'tale'을 의미합니다. 이는 경험이나 상상을 나누는 데 일상이나 문학에서 사용됩니다."
  },
  {
    "korean": "꿈꾸다",
    "english": "To Dream",
    "details_en": "The verb '꿈꾸다' (kkumkkuda) means 'to dream' in Korean. It signifies both literal dreaming during sleep and imagining hopes and goals.",
    "details_ko": "동사 '꿈꾸다'는 한국어로 'to dream'을 의미합니다. 이는 잠자는 동안의 꿈이나 희망, 목표를 상상하는 것을 뜻합니다."
  },
  {
    "korean": "기억",
    "english": "Memory",
    "details_en": "The word '기억' (gieok) means 'memory' in Korean. It refers to the act of remembering or a specific recollection.",
    "details_ko": "단어 '기억'은 한국어로 'memory'를 의미합니다. 이는 기억하는 행위나 특정한 회상을 뜻합니다."
  },
  {
    "korean": "생각",
    "english": "Thought",
    "details_en": "The word '생각' (saenggak) means 'thought' or 'idea' in Korean. It refers to the mental process of thinking or forming opinions.",
    "details_ko": "단어 '생각'은 한국어로 'thought' 또는 'idea'를 의미합니다. 이는 사고하거나 의견을 형성하는 정신적 과정을 뜻합니다."
  },
  {
    "korean": "느낌",
    "english": "Feeling",
    "details_en": "The word '느낌' (neukkim) means 'feeling' or 'sensation' in Korean. It describes emotions or physical sensations.",
    "details_ko": "단어 '느낌'은 한국어로 'feeling' 또는 'sensation'을 의미합니다. 이는 감정이나 신체적 느낌을 설명합니다."
  },
  {
    "korean": "문",
    "english": "Door",
    "details_en": "The word '문' (mun) means 'door' in Korean. It represents physical entrances as well as metaphorical opportunities.",
    "details_ko": "단어 '문'은 한국어로 'door'를 의미합니다. 이는 물리적인 출입구뿐만 아니라 비유적인 기회를 나타내기도 합니다."
  },
  {
    "korean": "창문",
    "english": "Window",
    "details_en": "The word '창문' (changmun) means 'window' in Korean. It allows light and air into a space and can symbolize perspective.",
    "details_ko": "단어 '창문'은 한국어로 'window'를 의미합니다. 이는 공간에 빛과 공기를 들이며 시각적인 관점을 상징할 수 있습니다."
  },
  {
    "korean": "책",
    "english": "Book",
    "details_en": "The word '책' (chaek) means 'book' in Korean. Books are essential tools for education, information, and imagination.",
    "details_ko": "단어 '책'은 한국어로 'book'을 의미합니다. 책은 교육, 정보, 상상력의 필수적인 도구입니다."
  },
  {
    "korean": "의자",
    "english": "Chair",
    "details_en": "The word '의자' (uija) means 'chair' in Korean. It is a common object used for sitting and often seen in everyday life.",
    "details_ko": "단어 '의자'는 한국어로 'chair'를 의미합니다. 이는 앉는 데 사용되는 일반적인 물건으로, 일상에서 자주 볼 수 있습니다."
  },
  {
    "korean": "거울",
    "english": "Mirror",
    "details_en": "The word '거울' (geoul) means 'mirror' in Korean. Mirrors reflect images and are often linked with self-reflection and beauty.",
    "details_ko": "단어 '거울'은 한국어로 'mirror'를 의미합니다. 이는 이미지를 반사하며, 자기 성찰이나 아름다움과 관련이 있습니다."
  },
  {
    "korean": "침대",
    "english": "Bed",
    "details_en": "The word '침대' (chimdae) means 'bed' in Korean. A bed is used for sleeping and resting and symbolizes comfort and privacy.",
    "details_ko": "단어 '침대'는 한국어로 'bed'를 의미합니다. 침대는 잠이나 휴식을 위한 공간으로, 안락함과 사적인 공간을 상징합니다."
  },
  {
    "korean": "전화",
    "english": "Telephone",
    "details_en": "The word '전화' (jeonhwa) means 'telephone' in Korean. It refers to communication by voice over long distances.",
    "details_ko": "단어 '전화'는 한국어로 'telephone'을 의미합니다. 이는 먼 거리에서 음성으로 소통하는 수단입니다."
  },
  {
    "korean": "컴퓨터",
    "english": "Computer",
    "details_en": "The word '컴퓨터' (keompyuteo) means 'computer' in Korean. It plays a crucial role in modern life for work, education, and communication.",
    "details_ko": "단어 '컴퓨터'는 한국어로 'computer'를 의미합니다. 이는 업무, 교육, 소통 등 현대 생활에서 중요한 역할을 합니다."
  },
  {
    "korean": "연필",
    "english": "Pencil",
    "details_en": "The word '연필' (yeonpil) means 'pencil' in Korean. It is a writing tool made of wood or plastic with a graphite core.",
    "details_ko": "단어 '연필'은 한국어로 'pencil'을 의미합니다. 이는 흑연심이 들어 있는 나무나 플라스틱 재질의 필기 도구입니다."
  },
  {
    "korean": "지우개",
    "english": "Eraser",
    "details_en": "The word '지우개' (jiugae) means 'eraser' in Korean. It is used to remove pencil marks from paper.",
    "details_ko": "단어 '지우개'는 한국어로 'eraser'를 의미합니다. 이는 종이에 쓴 연필 자국을 지우는 데 사용됩니다."
  },
  {
    "korean": "가방",
    "english": "Bag",
    "details_en": "The word '가방' (gabang) means 'bag' in Korean. It refers to a container used for carrying belongings.",
    "details_ko": "단어 '가방'은 한국어로 'bag'을 의미합니다. 이는 소지품을 담는 데 사용되는 용기를 나타냅니다."
  },
  {
    "korean": "시계",
    "english": "Clock / Watch",
    "details_en": "The word '시계' (sigye) means 'clock' or 'watch' in Korean. It is used to measure and indicate time.",
    "details_ko": "단어 '시계'는 한국어로 'clock' 또는 'watch'를 의미합니다. 이는 시간을 측정하고 표시하는 데 사용됩니다."
  },
  {
    "korean": "창고",
    "english": "Storage / Warehouse",
    "details_en": "The word '창고' (changgo) means 'storage' or 'warehouse' in Korean. It refers to a place where goods or items are kept.",
    "details_ko": "단어 '창고'는 한국어로 'storage' 또는 'warehouse'를 의미합니다. 이는 물건이나 상품을 보관하는 장소를 뜻합니다."
  },
  {
    "korean": "우산",
    "english": "Umbrella",
    "details_en": "The word '우산' (usan) means 'umbrella' in Korean. It is used for protection from rain or sunlight.",
    "details_ko": "단어 '우산'은 한국어로 'umbrella'를 의미합니다. 이는 비나 햇빛으로부터 몸을 보호하는 데 사용됩니다."
  },
  {
    "korean": "카메라",
    "english": "Camera",
    "details_en": "The word '카메라' (kamera) means 'camera' in Korean. It is a device used to capture photographs or videos.",
    "details_ko": "단어 '카메라'는 한국어로 'camera'를 의미합니다. 이는 사진이나 동영상을 촬영하는 장치입니다."
  },
  {
    "korean": "라디오",
    "english": "Radio",
    "details_en": "The word '라디오' (radio) means 'radio' in Korean. It is used to receive audio broadcasts and music.",
    "details_ko": "단어 '라디오'는 한국어로 'radio'를 의미합니다. 이는 오디오 방송이나 음악을 수신하는 데 사용됩니다."
  },
  {
    "korean": "텔레비전",
    "english": "Television",
    "details_en": "The word '텔레비전' (tellebijeon) means 'television' in Korean. It is used for watching visual media and broadcasts.",
    "details_ko": "단어 '텔레비전'은 한국어로 'television'을 의미합니다. 이는 시각 매체와 방송을 시청하는 데 사용됩니다."
  },
  {
    "korean": "신문",
    "english": "Newspaper",
    "details_en": "The word '신문' (sinmun) means 'newspaper' in Korean. It is a printed or digital publication for news and information.",
    "details_ko": "단어 '신문'은 한국어로 'newspaper'를 의미합니다. 이는 뉴스와 정보를 제공하는 인쇄물 또는 디지털 자료입니다."
  },
  {
    "korean": "잡지",
    "english": "Magazine",
    "details_en": "The word '잡지' (japji) means 'magazine' in Korean. It is a periodic publication with articles, images, and stories.",
    "details_ko": "단어 '잡지'는 한국어로 'magazine'을 의미합니다. 이는 기사, 이미지, 이야기를 포함한 정기 간행물입니다."
  },
  {
    "korean": "연구",
    "english": "Research",
    "details_en": "The word '연구' (yeongu) means 'research' in Korean. It refers to systematic investigation or study to gain knowledge.",
    "details_ko": "단어 '연구'는 한국어로 'research'를 의미합니다. 이는 지식을 얻기 위한 체계적인 조사나 연구를 뜻합니다."
  },
  {
    "korean": "시험",
    "english": "Test / Exam",
    "details_en": "The word '시험' (siheom) means 'test' or 'exam' in Korean. It is an assessment to evaluate knowledge or skills.",
    "details_ko": "단어 '시험'은 한국어로 'test' 또는 'exam'을 의미합니다. 이는 지식이나 능력을 평가하는 시험입니다."
  },
  {
    "korean": "학생",
    "english": "Student",
    "details_en": "The word '학생' (haksaeng) means 'student' in Korean. It refers to a person who is studying at a school or university.",
    "details_ko": "단어 '학생'은 한국어로 'student'를 의미합니다. 이는 학교나 대학에서 공부하는 사람을 뜻합니다."
  },
  {
    "korean": "선생님",
    "english": "Teacher",
    "details_en": "The word '선생님' (seonsaengnim) means 'teacher' in Korean. It is a respectful term for someone who teaches.",
    "details_ko": "단어 '선생님'은 한국어로 'teacher'를 의미합니다. 이는 누군가를 가르치는 사람을 공손하게 부르는 말입니다."
  },
  {
    "korean": "학교",
    "english": "School",
    "details_en": "The word '학교' (hakgyo) means 'school' in Korean. It is an institution for education and learning.",
    "details_ko": "단어 '학교'는 한국어로 'school'을 의미합니다. 이는 교육과 학습을 위한 기관입니다."
  },
  {
    "korean": "대학",
    "english": "University",
    "details_en": "The word '대학' (daehak) means 'university' in Korean. It refers to higher education institutions offering degrees.",
    "details_ko": "단어 '대학'은 한국어로 'university'를 의미합니다. 이는 학위를 제공하는 고등 교육 기관을 뜻합니다."
  },
  {
    "korean": "공부",
    "english": "Study",
    "details_en": "The word '공부' (gongbu) means 'study' in Korean. It refers to the act of learning or acquiring knowledge.",
    "details_ko": "단어 '공부'는 한국어로 'study'를 의미합니다. 이는 지식을 배우거나 습득하는 행위를 뜻합니다."
  },
  {
    "korean": "교실",
    "english": "Classroom",
    "details_en": "The word '교실' (gyosil) means 'classroom' in Korean. It is a space in a school where lessons are taught.",
    "details_ko": "단어 '교실'은 한국어로 'classroom'을 의미합니다. 이는 수업이 이루어지는 학교 내 공간입니다."
  },
  {
    "korean": "도서관",
    "english": "Library",
    "details_en": "The word '도서관' (doseogwan) means 'library' in Korean. It is a place where books and resources are available for study or leisure.",
    "details_ko": "단어 '도서관'은 한국어로 'library'를 의미합니다. 이는 공부나 여가를 위한 책과 자료가 있는 장소입니다."
  },
  {
    "korean": "공원",
    "english": "Park",
    "details_en": "The word '공원' (gongwon) means 'park' in Korean. It is a public space for relaxation, recreation, and nature.",
    "details_ko": "단어 '공원'은 한국어로 'park'을 의미합니다. 이는 휴식, 여가, 자연을 위한 공공 장소입니다."
  },
  {
    "korean": "병원",
    "english": "Hospital",
    "details_en": "The word '병원' (byeongwon) means 'hospital' in Korean. It is a medical facility for treatment and care.",
    "details_ko": "단어 '병원'은 한국어로 'hospital'을 의미합니다. 이는 치료와 간호를 위한 의료 시설입니다."
  },
  {
    "korean": "약국",
    "english": "Pharmacy",
    "details_en": "The word '약국' (yakguk) means 'pharmacy' in Korean. It is a place where medicines are sold and dispensed.",
    "details_ko": "단어 '약국'은 한국어로 'pharmacy'를 의미합니다. 이는 약을 판매하고 조제하는 장소입니다."
  },
  {
    "korean": "시장",
    "english": "Market",
    "details_en": "The word '시장' (sijang) means 'market' in Korean. It refers to a place where goods are bought and sold.",
    "details_ko": "단어 '시장'은 한국어로 'market'을 의미합니다. 이는 물건이 사고팔리는 장소를 의미합니다."
  },
  {
    "korean": "마트",
    "english": "Mart",
    "details_en": "The word '마트' (mateu) means 'mart' or 'supermarket' in Korean. It is a place to buy groceries and household items.",
    "details_ko": "단어 '마트'는 한국어로 'mart' 또는 'supermarket'을 의미합니다. 이는 식료품과 생활용품을 구매하는 곳입니다."
  },
  {
    "korean": "은행",
    "english": "Bank",
    "details_en": "The word '은행' (eunhaeng) means 'bank' in Korean. It is a financial institution for money-related services.",
    "details_ko": "단어 '은행'은 한국어로 'bank'를 의미합니다. 이는 금융 서비스를 제공하는 기관입니다."
  },
  {
    "korean": "우체국",
    "english": "Post Office",
    "details_en": "The word '우체국' (ucheguk) means 'post office' in Korean. It provides mail and delivery services.",
    "details_ko": "단어 '우체국'은 한국어로 'post office'를 의미합니다. 이는 우편과 배달 서비스를 제공합니다."
  },
  {
    "korean": "경찰서",
    "english": "Police Station",
    "details_en": "The word '경찰서' (gyeongchalseo) means 'police station' in Korean. It is the headquarters for local police.",
    "details_ko": "단어 '경찰서'는 한국어로 'police station'을 의미합니다. 이는 지역 경찰의 본부입니다."
  },
  {
    "korean": "소방서",
    "english": "Fire Station",
    "details_en": "The word '소방서' (sobangseo) means 'fire station' in Korean. It is where firefighters operate from.",
    "details_ko": "단어 '소방서'는 한국어로 'fire station'을 의미합니다. 이는 소방관들이 근무하는 장소입니다."
  },
  {
    "korean": "버스",
    "english": "Bus",
    "details_en": "The word '버스' (beoseu) means 'bus' in Korean. It is a common form of public transportation.",
    "details_ko": "단어 '버스'는 한국어로 'bus'를 의미합니다. 이는 흔한 대중교통 수단입니다."
  },
  {
    "korean": "기차",
    "english": "Train",
    "details_en": "The word '기차' (gicha) means 'train' in Korean. Trains are widely used for intercity travel in Korea.",
    "details_ko": "단어 '기차'는 한국어로 'train'을 의미합니다. 기차는 도시 간 이동에 널리 사용됩니다."
  },
  {
    "korean": "비행기",
    "english": "Airplane",
    "details_en": "The word '비행기' (bihaenggi) means 'airplane' in Korean. It is a vehicle used for air travel.",
    "details_ko": "단어 '비행기'는 한국어로 'airplane'을 의미합니다. 이는 항공 여행을 위한 교통 수단입니다."
  },
  {
    "korean": "자동차",
    "english": "Car",
    "details_en": "The word '자동차' (jadongcha) means 'car' in Korean. Cars are personal vehicles used for daily transport.",
    "details_ko": "단어 '자동차'는 한국어로 'car'를 의미합니다. 이는 일상적인 이동을 위한 개인 차량입니다."
  },
  {
    "korean": "자전거",
    "english": "Bicycle",
    "details_en": "The word '자전거' (jajeongeo) means 'bicycle' in Korean. It is a human-powered vehicle with two wheels.",
    "details_ko": "단어 '자전거'는 한국어로 'bicycle'을 의미합니다. 이는 두 바퀴로 된 인력 교통 수단입니다."
  },
  {
    "korean": "택시",
    "english": "Taxi",
    "details_en": "The word '택시' (taegsi) means 'taxi' in Korean. It is a vehicle for hire to transport passengers.",
    "details_ko": "단어 '택시'는 한국어로 'taxi'를 의미합니다. 이는 승객을 태우는 유료 차량입니다."
  },
  {
    "korean": "지하철",
    "english": "Subway",
    "details_en": "The word '지하철' (jihacheol) means 'subway' in Korean. It is a popular underground public transportation.",
    "details_ko": "단어 '지하철'은 한국어로 'subway'를 의미합니다. 이는 인기 있는 지하 대중교통 수단입니다."
  },
  {
    "korean": "배",
    "english": "Boat / Ship",
    "details_en": "The word '배' (bae) means 'boat' or 'ship' in Korean. It is used for water travel and transport.",
    "details_ko": "단어 '배'는 한국어로 'boat' 또는 'ship'을 의미합니다. 이는 수상 이동 및 운송에 사용됩니다."
  },
  {
    "korean": "운전",
    "english": "Driving",
    "details_en": "The word '운전' (unjeon) means 'driving' in Korean. It refers to the act of operating a vehicle.",
    "details_ko": "단어 '운전'은 한국어로 'driving'을 의미합니다. 이는 차량을 조작하는 행위를 말합니다."
  },
  {
    "korean": "속도",
    "english": "Speed",
    "details_en": "The word '속도' (sokdo) means 'speed' in Korean. It describes how fast something is moving.",
    "details_ko": "단어 '속도'는 한국어로 'speed'를 의미합니다. 이는 어떤 것이 얼마나 빠르게 움직이는지를 나타냅니다."
  },
  {
    "korean": "표",
    "english": "Ticket",
    "details_en": "The word '표' (pyo) means 'ticket' in Korean. It is used for entry or travel purposes.",
    "details_ko": "단어 '표'는 한국어로 'ticket'을 의미합니다. 이는 입장이나 이동 시 사용되는 표입니다."
  },
  {
    "korean": "지도",
    "english": "Map",
    "details_en": "The word '지도' (jido) means 'map' in Korean. It shows geographical areas and directions.",
    "details_ko": "단어 '지도'는 한국어로 'map'을 의미합니다. 이는 지리적 영역과 방향을 보여줍니다."
  },
  {
    "korean": "길",
    "english": "Road / Way",
    "details_en": "The word '길' (gil) means 'road' or 'way' in Korean. It refers to a path for traveling or moving.",
    "details_ko": "단어 '길'은 한국어로 'road' 또는 'way'를 의미합니다. 이는 이동을 위한 경로를 뜻합니다."
  },
  {
    "korean": "건물",
    "english": "Building",
    "details_en": "The word '건물' (geonmul) means 'building' in Korean. It refers to any structure with walls and a roof.",
    "details_ko": "단어 '건물'은 한국어로 'building'을 의미합니다. 이는 벽과 지붕이 있는 구조물을 말합니다."
  },
  {
    "korean": "다리",
    "english": "Bridge / Leg",
    "details_en": "The word '다리' (dari) means both 'bridge' and 'leg' in Korean, depending on the context.",
    "details_ko": "단어 '다리'는 문맥에 따라 'bridge' 또는 'leg'를 의미합니다."
  },
  {
    "korean": "도로",
    "english": "Road",
    "details_en": "The word '도로' (doro) means 'road' in Korean. It usually refers to highways or main streets.",
    "details_ko": "단어 '도로'는 한국어로 'road'를 의미합니다. 이는 주로 고속도로나 주요 도로를 지칭합니다."
  },
  {
    "korean": "신호등",
    "english": "Traffic Light",
    "details_en": "The word '신호등' (sinho-deung) means 'traffic light' in Korean. It controls vehicle and pedestrian traffic.",
    "details_ko": "단어 '신호등'은 한국어로 'traffic light'을 의미합니다. 이는 차량과 보행자 교통을 조절합니다."
  },
  {
    "korean": "정류장",
    "english": "Bus Stop",
    "details_en": "The word '정류장' (jeongryujang) means 'bus stop' in Korean. It is a designated place where buses stop to pick up passengers.",
    "details_ko": "단어 '정류장'은 한국어로 'bus stop'을 의미합니다. 이는 버스가 승객을 태우기 위해 정차하는 지정된 장소입니다."
  },
  {
    "korean": "터널",
    "english": "Tunnel",
    "details_en": "The word '터널' (teoneol) means 'tunnel' in Korean. It refers to an underground or enclosed passageway.",
    "details_ko": "단어 '터널'은 한국어로 'tunnel'을 의미합니다. 이는 지하나 밀폐된 통로를 나타냅니다."
  },
  {
    "korean": "고속도로",
    "english": "Highway",
    "details_en": "The word '고속도로' (gosokdoro) means 'highway' in Korean. It is a high-speed road for long-distance travel.",
    "details_ko": "단어 '고속도로'는 한국어로 'highway'를 의미합니다. 이는 장거리 이동을 위한 고속 도로입니다."
  },
  {
    "korean": "날씨",
    "english": "Weather",
    "details_en": "The word '날씨' (nalssi) means 'weather' in Korean. It refers to atmospheric conditions such as temperature, rain, and wind.",
    "details_ko": "단어 '날씨'는 한국어로 'weather'를 의미합니다. 이는 온도, 비, 바람 등의 기상 상태를 나타냅니다."
  },
  {
    "korean": "비",
    "english": "Rain",
    "details_en": "The word '비' (bi) means 'rain' in Korean. It is a form of precipitation that falls from clouds.",
    "details_ko": "단어 '비'는 한국어로 'rain'을 의미합니다. 이는 구름에서 떨어지는 강수 형태입니다."
  },
  {
    "korean": "눈",
    "english": "Snow / Eye",
    "details_en": "The word '눈' (nun) can mean both 'snow' and 'eye' in Korean, depending on the context.",
    "details_ko": "단어 '눈'은 문맥에 따라 'snow' 또는 'eye'를 의미할 수 있습니다."
  },
  {
    "korean": "바람",
    "english": "Wind",
    "details_en": "The word '바람' (baram) means 'wind' in Korean. It refers to moving air.",
    "details_ko": "단어 '바람'은 한국어로 'wind'를 의미합니다. 이는 움직이는 공기를 나타냅니다."
  },
  {
    "korean": "온도",
    "english": "Temperature",
    "details_en": "The word '온도' (ondo) means 'temperature' in Korean. It describes how hot or cold something is.",
    "details_ko": "단어 '온도'는 한국어로 'temperature'를 의미합니다. 이는 얼마나 덥거나 추운지를 나타냅니다."
  },
  {
    "korean": "계절",
    "english": "Season",
    "details_en": "The word '계절' (gyejeol) means 'season' in Korean. Korea has four distinct seasons: spring, summer, fall, and winter.",
    "details_ko": "단어 '계절'은 한국어로 'season'을 의미합니다. 한국은 봄, 여름, 가을, 겨울의 뚜렷한 사계절을 가집니다."
  },
  {
    "korean": "봄",
    "english": "Spring",
    "details_en": "The word '봄' (bom) means 'spring' in Korean. It is the season of blooming flowers and warming weather.",
    "details_ko": "단어 '봄'은 한국어로 'spring'을 의미합니다. 이는 꽃이 피고 날씨가 따뜻해지는 계절입니다."
  },
  {
    "korean": "여름",
    "english": "Summer",
    "details_en": "The word '여름' (yeoreum) means 'summer' in Korean. It is the hottest season with long daylight.",
    "details_ko": "단어 '여름'은 한국어로 'summer'를 의미합니다. 이는 가장 더운 계절이며 낮이 깁니다."
  },
  {
    "korean": "가을",
    "english": "Autumn / Fall",
    "details_en": "The word '가을' (gaeul) means 'autumn' or 'fall' in Korean. It is the season of harvest and cool weather.",
    "details_ko": "단어 '가을'은 한국어로 'autumn' 또는 'fall'을 의미합니다. 이는 수확의 계절이며 시원한 날씨를 특징으로 합니다."
  },
  {
    "korean": "겨울",
    "english": "Winter",
    "details_en": "The word '겨울' (gyeoul) means 'winter' in Korean. It is the coldest season with snow in many regions.",
    "details_ko": "단어 '겨울'은 한국어로 'winter'를 의미합니다. 이는 가장 추운 계절이며 많은 지역에서 눈이 내립니다."
  },
  {
    "korean": "하늘",
    "english": "Sky",
    "details_en": "The word '하늘' (haneul) means 'sky' in Korean. It refers to the expanse above the earth, often associated with weather or divinity.",
    "details_ko": "단어 '하늘'은 한국어로 'sky'를 의미합니다. 이는 지구 위의 공간을 나타내며, 날씨나 신성함과도 연관됩니다."
  },
  {
    "korean": "해",
    "english": "Sun / Year",
    "details_en": "The word '해' (hae) can mean both 'sun' and 'year' in Korean, depending on context.",
    "details_ko": "단어 '해'는 문맥에 따라 'sun' 또는 'year'를 의미할 수 있습니다."
  },
  {
    "korean": "달",
    "english": "Moon / Month",
    "details_en": "The word '달' (dal) means both 'moon' and 'month' in Korean, depending on context.",
    "details_ko": "단어 '달'은 한국어로 'moon' 또는 'month'를 의미할 수 있으며 문맥에 따라 달라집니다."
  },
  {
    "korean": "별",
    "english": "Star",
    "details_en": "The word '별' (byeol) means 'star' in Korean. It refers to the celestial bodies seen at night.",
    "details_ko": "단어 '별'은 한국어로 'star'를 의미합니다. 이는 밤하늘에서 보이는 천체를 나타냅니다."
  },
  {
    "korean": "구름",
    "english": "Cloud",
    "details_en": "The word '구름' (gureum) means 'cloud' in Korean. It is a visible mass of condensed water vapor in the sky.",
    "details_ko": "단어 '구름'은 한국어로 'cloud'를 의미합니다. 이는 하늘에 떠 있는 응결된 수증기의 덩어리입니다."
  },
  {
    "korean": "번개",
    "english": "Lightning",
    "details_en": "The word '번개' (beongae) means 'lightning' in Korean. It is a sudden electrical discharge in the sky.",
    "details_ko": "단어 '번개'는 한국어로 'lightning'을 의미합니다. 이는 하늘에서 발생하는 전기 방전입니다."
  },
  {
    "korean": "천둥",
    "english": "Thunder",
    "details_en": "The word '천둥' (cheondung) means 'thunder' in Korean. It is the sound caused by lightning.",
    "details_ko": "단어 '천둥'은 한국어로 'thunder'를 의미합니다. 이는 번개에 의해 발생하는 소리입니다."
  },
  {
    "korean": "습도",
    "english": "Humidity",
    "details_en": "The word '습도' (seupdo) means 'humidity' in Korean. It refers to the amount of moisture in the air.",
    "details_ko": "단어 '습도'는 한국어로 'humidity'를 의미합니다. 이는 공기 중 수분의 양을 나타냅니다."
  },
  {
    "korean": "맑다",
    "english": "Clear (weather)",
    "details_en": "The word '맑다' (makda) means 'clear' in Korean. It often describes sunny, cloudless weather.",
    "details_ko": "단어 '맑다'는 한국어로 'clear'를 의미합니다. 주로 맑고 구름 없는 날씨를 표현할 때 사용됩니다."
  },
  {
    "korean": "흐리다",
    "english": "Cloudy",
    "details_en": "The word '흐리다' (heurida) means 'cloudy' in Korean. It describes overcast or dull weather conditions.",
    "details_ko": "단어 '흐리다'는 한국어로 'cloudy'를 의미합니다. 이는 흐리거나 칙칙한 날씨를 나타냅니다."
  },
  {
    "korean": "춥다",
    "english": "Cold",
    "details_en": "The word '춥다' (chupda) means 'cold' in Korean. It is used to describe low temperatures.",
    "details_ko": "단어 '춥다'는 한국어로 'cold'를 의미합니다. 이는 낮은 온도를 나타내는 데 사용됩니다."
  },
  {
    "korean": "덥다",
    "english": "Hot",
    "details_en": "The word '덥다' (deopda) means 'hot' in Korean. It refers to high temperatures or weather.",
    "details_ko": "단어 '덥다'는 한국어로 'hot'을 의미합니다. 이는 높은 온도나 날씨를 나타냅니다."
  },
  {
    "korean": "서늘하다",
    "english": "Cool",
    "details_en": "The word '서늘하다' (seoneulhada) means 'cool' in Korean. It refers to pleasantly chilly temperatures.",
    "details_ko": "단어 '서늘하다'는 한국어로 'cool'을 의미합니다. 이는 기분 좋게 선선한 날씨를 나타냅니다."
  },
  {
    "korean": "따뜻하다",
    "english": "Warm",
    "details_en": "The word '따뜻하다' (ttatteuthada) means 'warm' in Korean. It describes a mild and comfortable temperature.",
    "details_ko": "단어 '따뜻하다'는 한국어로 'warm'을 의미합니다. 이는 온화하고 편안한 온도를 나타냅니다."
  },
  {
    "korean": "일기예보",
    "english": "Weather Forecast",
    "details_en": "The word '일기예보' (ilgiyebo) means 'weather forecast' in Korean. It refers to predicted weather conditions.",
    "details_ko": "단어 '일기예보'는 한국어로 'weather forecast'를 의미합니다. 이는 예측된 날씨 상태를 말합니다."
  },
  {
    "korean": "기온",
    "english": "Temperature (Air)",
    "details_en": "The word '기온' (gion) means 'air temperature' in Korean. It is often used in weather reports.",
    "details_ko": "단어 '기온'은 한국어로 'air temperature'를 의미합니다. 이는 일기예보에서 자주 사용됩니다."
  },
  {
    "korean": "기후",
    "english": "Climate",
    "details_en": "The word '기후' (gihu) means 'climate' in Korean. It refers to long-term weather patterns of a region.",
    "details_ko": "단어 '기후'는 한국어로 'climate'를 의미합니다. 이는 한 지역의 장기적인 날씨 패턴을 나타냅니다."
  },
  {
    "korean": "장마",
    "english": "Rainy Season",
    "details_en": "The word '장마' (jangma) means 'rainy season' in Korean. It usually occurs in summer with frequent rain.",
    "details_ko": "단어 '장마'는 한국어로 'rainy season'을 의미합니다. 이는 여름에 자주 내리는 비의 시기를 말합니다."
  },
  {
    "korean": "무지개",
    "english": "Rainbow",
    "details_en": "The word '무지개' (mujigae) means 'rainbow' in Korean. It is a multicolored arc seen after rain.",
    "details_ko": "단어 '무지개'는 한국어로 'rainbow'를 의미합니다. 이는 비 후에 나타나는 여러 색의 호입니다."
  },
  {
    "korean": "산",
    "english": "Mountain",
    "details_en": "The word '산' (san) means 'mountain' in Korean. Mountains are common in Korea and hold cultural and spiritual significance.",
    "details_ko": "단어 '산'은 한국어로 'mountain'을 의미합니다. 산은 한국에서 흔하며 문화적, 정신적 의미를 지닙니다."
  },
  {
    "korean": "강",
    "english": "River",
    "details_en": "The word '강' (gang) means 'river' in Korean. Rivers are important for water, transportation, and tradition.",
    "details_ko": "단어 '강'은 한국어로 'river'를 의미합니다. 강은 물과 교통, 전통에서 중요한 역할을 합니다."
  },
  {
    "korean": "바다",
    "english": "Sea",
    "details_en": "The word '바다' (bada) means 'sea' in Korean. Korea is surrounded by seas on three sides, influencing its cuisine and culture.",
    "details_ko": "단어 '바다'는 한국어로 'sea'를 의미합니다. 한국은 삼면이 바다로 둘러싸여 있어 음식과 문화에 큰 영향을 줍니다."
  },
  {
    "korean": "호수",
    "english": "Lake",
    "details_en": "The word '호수' (hosu) means 'lake' in Korean. Lakes are calm bodies of water, often found in parks and mountains.",
    "details_ko": "단어 '호수'는 한국어로 'lake'를 의미합니다. 호수는 잔잔한 물로, 공원이나 산에서 자주 볼 수 있습니다."
  },
  {
    "korean": "섬",
    "english": "Island",
    "details_en": "The word '섬' (seom) means 'island' in Korean. Korea has many beautiful islands like Jeju.",
    "details_ko": "단어 '섬'은 한국어로 'island'를 의미합니다. 한국에는 제주도와 같은 아름다운 섬이 많습니다."
  },
  {
    "korean": "나무",
    "english": "Tree",
    "details_en": "The word '나무' (namu) means 'tree' in Korean. Trees are vital to the environment and are admired in Korean gardens and temples.",
    "details_ko": "단어 '나무'는 한국어로 'tree'를 의미합니다. 나무는 환경에 중요하며, 정원이나 사찰에서 자주 볼 수 있습니다."
  },
  {
    "korean": "숲",
    "english": "Forest",
    "details_en": "The word '숲' (sup) means 'forest' in Korean. Forests are places of relaxation and nature preservation.",
    "details_ko": "단어 '숲'은 한국어로 'forest'를 의미합니다. 숲은 휴식과 자연 보존의 장소입니다."
  },
  {
    "korean": "풀",
    "english": "Grass",
    "details_en": "The word '풀' (pul) means 'grass' in Korean. Grass grows in fields, lawns, and parks.",
    "details_ko": "단어 '풀'은 한국어로 'grass'를 의미합니다. 풀은 들판, 잔디밭, 공원 등에 자랍니다."
  },
  {
    "korean": "꽃",
    "english": "Flower",
    "details_en": "The word '꽃' (kkot) means 'flower' in Korean. Flowers are widely appreciated in Korean culture for beauty and symbolism.",
    "details_ko": "단어 '꽃'은 한국어로 'flower'를 의미합니다. 꽃은 아름다움과 상징성으로 한국 문화에서 사랑받습니다."
  },
  {
    "korean": "잎",
    "english": "Leaf",
    "details_en": "The word '잎' (ip) means 'leaf' in Korean. Leaves change colors in autumn and symbolize life.",
    "details_ko": "단어 '잎'은 한국어로 'leaf'를 의미합니다. 잎은 가을에 색이 변하며 생명을 상징합니다."
  },
  {
    "korean": "뿌리",
    "english": "Root",
    "details_en": "The word '뿌리' (ppuri) means 'root' in Korean. Roots anchor a plant and absorb nutrients from the soil.",
    "details_ko": "단어 '뿌리'는 한국어로 'root'를 의미합니다. 뿌리는 식물을 고정시키고 흙에서 영양분을 흡수합니다."
  },
  {
    "korean": "줄기",
    "english": "Stem",
    "details_en": "The word '줄기' (julgi) means 'stem' in Korean. It supports the plant and transports water and nutrients.",
    "details_ko": "단어 '줄기'는 한국어로 'stem'을 의미합니다. 줄기는 식물을 지지하고 물과 영양분을 운반합니다."
  },
  {
    "korean": "열매",
    "english": "Fruit",
    "details_en": "The word '열매' (yeolmae) means 'fruit' in Korean. It is the mature ovary of a flower and often edible.",
    "details_ko": "단어 '열매'는 한국어로 'fruit'를 의미합니다. 이는 꽃의 성숙한 자방으로, 보통 먹을 수 있습니다."
  },
  {
    "korean": "씨앗",
    "english": "Seed",
    "details_en": "The word '씨앗' (ssiat) means 'seed' in Korean. Seeds are essential for plant reproduction.",
    "details_ko": "단어 '씨앗'은 한국어로 'seed'를 의미합니다. 씨앗은 식물 번식에 필수적입니다."
  },
  {
    "korean": "동물",
    "english": "Animal",
    "details_en": "The word '동물' (dongmul) means 'animal' in Korean. It refers to all living creatures that are not plants.",
    "details_ko": "단어 '동물'은 한국어로 'animal'을 의미합니다. 이는 식물이 아닌 모든 생명체를 포함합니다."
  },
  {
    "korean": "새",
    "english": "Bird",
    "details_en": "The word '새' (sae) means 'bird' in Korean. Birds are flying animals with feathers.",
    "details_ko": "단어 '새'는 한국어로 'bird'를 의미합니다. 새는 깃털이 있고 날 수 있는 동물입니다."
  },
  {
    "korean": "물고기",
    "english": "Fish",
    "details_en": "The word '물고기' (mulgogi) means 'fish' in Korean. Fish are aquatic animals that breathe through gills.",
    "details_ko": "단어 '물고기'는 한국어로 'fish'를 의미합니다. 물고기는 아가미로 호흡하는 수중 동물입니다."
  },
  {
    "korean": "벌레",
    "english": "Insect",
    "details_en": "The word '벌레' (beolle) means 'insect' or 'bug' in Korean. It refers to small invertebrates.",
    "details_ko": "단어 '벌레'는 한국어로 'insect' 또는 'bug'를 의미합니다. 이는 작은 무척추동물을 뜻합니다."
  },
  {
    "korean": "사자",
    "english": "Lion",
    "details_en": "The word '사자' (saja) means 'lion' in Korean. Lions are large wild cats known as the king of the jungle.",
    "details_ko": "단어 '사자'는 한국어로 'lion'을 의미합니다. 사자는 정글의 왕으로 불리는 대형 야생 고양이입니다."
  },
  {
    "korean": "호랑이",
    "english": "Tiger",
    "details_en": "The word '호랑이' (horangi) means 'tiger' in Korean. Tigers are iconic animals in Korean folklore.",
    "details_ko": "단어 '호랑이'는 한국어로 'tiger'를 의미합니다. 호랑이는 한국 전통 이야기에서 상징적인 동물입니다."
  },
  {
    "korean": "늑대",
    "english": "Wolf",
    "details_en": "The word '늑대' (neukdae) means 'wolf' in Korean. Wolves are wild animals known for living and hunting in packs.",
    "details_ko": "단어 '늑대'는 한국어로 'wolf'를 의미합니다. 늑대는 무리를 지어 사냥하는 야생 동물입니다."
  },
  {
    "korean": "여우",
    "english": "Fox",
    "details_en": "The word '여우' (yeou) means 'fox' in Korean. Foxes are clever animals often featured in Korean fairy tales.",
    "details_ko": "단어 '여우'는 한국어로 'fox'를 의미합니다. 여우는 한국 동화에서 영리한 동물로 자주 등장합니다."
  },
  {
    "korean": "곰",
    "english": "Bear",
    "details_en": "The word '곰' (gom) means 'bear' in Korean. Bears symbolize strength and are significant in Korean myths.",
    "details_ko": "단어 '곰'은 한국어로 'bear'를 의미합니다. 곰은 힘의 상징이며 한국 신화에서도 중요한 존재입니다."
  },
  {
    "korean": "코끼리",
    "english": "Elephant",
    "details_en": "The word '코끼리' (kokkiri) means 'elephant' in Korean. Elephants are the largest land animals on Earth.",
    "details_ko": "단어 '코끼리'는 한국어로 'elephant'를 의미합니다. 코끼리는 지구에서 가장 큰 육상 동물입니다."
  },
  {
    "korean": "원숭이",
    "english": "Monkey",
    "details_en": "The word '원숭이' (wonsungi) means 'monkey' in Korean. Monkeys are playful, intelligent animals.",
    "details_ko": "단어 '원숭이'는 한국어로 'monkey'를 의미합니다. 원숭이는 장난기 많고 지능이 높은 동물입니다."
  },
  {
    "korean": "토끼",
    "english": "Rabbit",
    "details_en": "The word '토끼' (tokki) means 'rabbit' in Korean. Rabbits are popular symbols of innocence and agility.",
    "details_ko": "단어 '토끼'는 한국어로 'rabbit'을 의미합니다. 토끼는 순수함과 민첩함의 상징입니다."
  },
  {
    "korean": "다람쥐",
    "english": "Squirrel",
    "details_en": "The word '다람쥐' (daramjwi) means 'squirrel' in Korean. Squirrels are small animals that collect nuts.",
    "details_ko": "단어 '다람쥐'는 한국어로 'squirrel'을 의미합니다. 다람쥐는 견과류를 모으는 작은 동물입니다."
  },
  {
    "korean": "개",
    "english": "Dog",
    "details_en": "The word '개' (gae) means 'dog' in Korean. Dogs are loyal and common pets.",
    "details_ko": "단어 '개'는 한국어로 'dog'를 의미합니다. 개는 충성스럽고 흔한 반려동물입니다."
  },
  {
    "korean": "고양이",
    "english": "Cat",
    "details_en": "The word '고양이' (goyangi) means 'cat' in Korean. Cats are beloved pets known for independence.",
    "details_ko": "단어 '고양이'는 한국어로 'cat'을 의미합니다. 고양이는 독립적인 성격으로 사랑받는 반려동물입니다."
  },
  {
    "korean": "말",
    "english": "Horse",
    "details_en": "The word '말' (mal) means 'horse' in Korean. Horses are strong animals used for riding and farming.",
    "details_ko": "단어 '말'은 한국어로 'horse'를 의미합니다. 말은 승마와 농사에 쓰이는 강한 동물입니다."
  },
  {
    "korean": "소",
    "english": "Cow",
    "details_en": "The word '소' (so) means 'cow' in Korean. Cows are farm animals known for milk and meat production.",
    "details_ko": "단어 '소'는 한국어로 'cow'를 의미합니다. 소는 우유와 고기를 제공하는 가축입니다."
  },
  {
    "korean": "돼지",
    "english": "Pig",
    "details_en": "The word '돼지' (dwaeji) means 'pig' in Korean. Pigs are intelligent animals and are also raised for meat.",
    "details_ko": "단어 '돼지'는 한국어로 'pig'를 의미합니다. 돼지는 똑똑한 동물이며 고기 생산에 사용됩니다."
  },
  {
    "korean": "닭",
    "english": "Chicken",
    "details_en": "The word '닭' (dak) means 'chicken' in Korean. Chickens are raised for both eggs and meat.",
    "details_ko": "단어 '닭'은 한국어로 'chicken'을 의미합니다. 닭은 계란과 고기를 위해 길러집니다."
  },
  {
    "korean": "양",
    "english": "Sheep",
    "details_en": "The word '양' (yang) means 'sheep' in Korean. Sheep are wool-producing animals symbolizing gentleness.",
    "details_ko": "단어 '양'은 한국어로 'sheep'을 의미합니다. 양은 양털을 제공하며 온순함을 상징합니다."
  },
  {
    "korean": "염소",
    "english": "Goat",
    "details_en": "The word '염소' (yeomso) means 'goat' in Korean. Goats are hardy animals known for climbing and producing milk.",
    "details_ko": "단어 '염소'는 한국어로 'goat'를 의미합니다. 염소는 우유를 생산하고 산악 지형을 잘 오릅니다."
  },
  {
    "korean": "공룡",
    "english": "Dinosaur",
    "details_en": "The word '공룡' (gongnyong) means 'dinosaur' in Korean. Dinosaurs are extinct reptiles from prehistoric times.",
    "details_ko": "단어 '공룡'은 한국어로 'dinosaur'를 의미합니다. 공룡은 고대의 멸종된 파충류입니다."
  },
  {
    "korean": "파리",
    "english": "Fly",
    "details_en": "The word '파리' (pari) means 'fly' (the insect) in Korean. Flies are small winged insects.",
    "details_ko": "단어 '파리'는 한국어로 'fly'를 의미합니다. 파리는 날개가 있는 작은 곤충입니다."
  },
  {
    "korean": "개미",
    "english": "Ant",
    "details_en": "The word '개미' (gaemi) means 'ant' in Korean. Ants live in colonies and are known for teamwork.",
    "details_ko": "단어 '개미'는 한국어로 'ant'를 의미합니다. 개미는 협력으로 잘 알려진 집단 생활을 합니다."
  },
  {
    "korean": "나비",
    "english": "Butterfly",
    "details_en": "The word '나비' (nabi) means 'butterfly' in Korean. Butterflies symbolize transformation and beauty.",
    "details_ko": "단어 '나비'는 한국어로 'butterfly'를 의미합니다. 나비는 변화와 아름다움을 상징합니다."
  },
  {
    "korean": "벌",
    "english": "Bee",
    "details_en": "The word '벌' (beol) means 'bee' in Korean. Bees are important for pollination and honey production.",
    "details_ko": "단어 '벌'은 한국어로 'bee'를 의미합니다. 벌은 꽃가루받이와 꿀 생산에 중요합니다."
  },
  {
    "korean": "지식",
    "english": "Knowledge",
    "details_en": "The word '지식' (jisik) means 'knowledge' in Korean. It refers to the understanding and information gained through learning and experience.",
    "details_ko": "단어 '지식'은 한국어로 'knowledge'를 의미합니다. 이는 학습과 경험을 통해 얻는 이해와 정보를 뜻합니다."
  },
  {
    "korean": "지혜",
    "english": "Wisdom",
    "details_en": "The word '지혜' (jihae) means 'wisdom' in Korean. It represents the ability to make sound decisions based on experience and insight.",
    "details_ko": "단어 '지혜'는 한국어로 'wisdom'을 의미합니다. 이는 경험과 통찰을 바탕으로 현명한 판단을 내리는 능력을 뜻합니다."
  },
  {
    "korean": "꿈",
    "english": "Dream",
    "details_en": "The word '꿈' (kkum) means 'dream' in Korean. It can refer to dreams during sleep or goals in life.",
    "details_ko": "단어 '꿈'은 한국어로 'dream'을 의미합니다. 이는 잠자는 동안 꾸는 꿈이나 인생의 목표를 나타낼 수 있습니다."
  },
  {
    "korean": "미래",
    "english": "Future",
    "details_en": "The word '미래' (mirae) means 'future' in Korean. It is used when discussing upcoming events or times ahead.",
    "details_ko": "단어 '미래'는 한국어로 'future'를 의미합니다. 이는 다가올 사건이나 시간을 말할 때 사용됩니다."
  },
  {
    "korean": "과거",
    "english": "Past",
    "details_en": "The word '과거' (gwageo) means 'past' in Korean. It refers to times and events that have already happened.",
    "details_ko": "단어 '과거'는 한국어로 'past'를 의미합니다. 이는 이미 지나간 시간이나 사건을 뜻합니다."
  },
  {
    "korean": "현재",
    "english": "Present",
    "details_en": "The word '현재' (hyeonjae) means 'present' in Korean. It represents the current moment or state of being.",
    "details_ko": "단어 '현재'는 한국어로 'present'를 의미합니다. 이는 지금 이 순간이나 현재 상태를 나타냅니다."
  },
  {
    "korean": "생각",
    "english": "Thought",
    "details_en": "The word '생각' (saenggak) means 'thought' in Korean. It refers to ideas or reflections in the mind.",
    "details_ko": "단어 '생각'은 한국어로 'thought'를 의미합니다. 이는 마음속의 아이디어나 성찰을 뜻합니다."
  },
  {
    "korean": "기억",
    "english": "Memory",
    "details_en": "The word '기억' (gieok) means 'memory' in Korean. It is used for recalling past experiences or knowledge.",
    "details_ko": "단어 '기억'은 한국어로 'memory'를 의미합니다. 이는 과거의 경험이나 지식을 떠올리는 것을 뜻합니다."
  },
  {
    "korean": "목표",
    "english": "Goal",
    "details_en": "The word '목표' (mokpyo) means 'goal' or 'objective' in Korean. It is something one strives to achieve.",
    "details_ko": "단어 '목표'는 한국어로 'goal' 또는 'objective'를 의미합니다. 이는 달성하려는 목표를 뜻합니다."
  },
  {
    "korean": "계획",
    "english": "Plan",
    "details_en": "The word '계획' (gyehoek) means 'plan' in Korean. It refers to a strategy or schedule prepared in advance.",
    "details_ko": "단어 '계획'은 한국어로 'plan'을 의미합니다. 이는 미리 준비된 전략이나 일정을 뜻합니다."
  },
  {
    "korean": "소망",
    "english": "Wish",
    "details_en": "The word '소망' (somang) means 'wish' in Korean. It represents a heartfelt hope or desire.",
    "details_ko": "단어 '소망'은 한국어로 'wish'를 의미합니다. 이는 간절한 희망이나 바람을 나타냅니다."
  },
  {
    "korean": "자유",
    "english": "Freedom",
    "details_en": "The word '자유' (jayu) means 'freedom' in Korean. It refers to the state of being free from constraints or oppression.",
    "details_ko": "단어 '자유'는 한국어로 'freedom'을 의미합니다. 이는 제약이나 억압이 없는 상태를 뜻합니다."
  },
  {
    "korean": "평화",
    "english": "Peace",
    "details_en": "The word '평화' (pyeonghwa) means 'peace' in Korean. It signifies harmony and the absence of conflict.",
    "details_ko": "단어 '평화'는 한국어로 'peace'를 의미합니다. 이는 갈등이 없는 조화로운 상태를 나타냅니다."
  },
  {
    "korean": "정의",
    "english": "Justice",
    "details_en": "The word '정의' (jeongui) means 'justice' in Korean. It denotes fairness and the moral rightness of actions.",
    "details_ko": "단어 '정의'는 한국어로 'justice'를 의미합니다. 이는 공정성과 도덕적으로 옳은 행위를 뜻합니다."
  },
  {
    "korean": "노력",
    "english": "Effort",
    "details_en": "The word '노력' (noryeok) means 'effort' in Korean. It refers to the exertion of physical or mental energy to achieve something.",
    "details_ko": "단어 '노력'은 한국어로 'effort'를 의미합니다. 이는 무언가를 이루기 위해 들이는 노력이나 에너지를 뜻합니다."
  },
  {
    "korean": "성공",
    "english": "Success",
    "details_en": "The word '성공' (seonggong) means 'success' in Korean. It signifies the achievement of a goal or ambition.",
    "details_ko": "단어 '성공'은 한국어로 'success'를 의미합니다. 이는 목표나 야망을 이루는 것을 뜻합니다."
  },
  {
    "korean": "실패",
    "english": "Failure",
    "details_en": "The word '실패' (silpae) means 'failure' in Korean. It represents the lack of success in achieving something.",
    "details_ko": "단어 '실패'는 한국어로 'failure'를 의미합니다. 이는 무언가를 이루지 못한 상태를 뜻합니다."
  },
  {
    "korean": "기회",
    "english": "Opportunity",
    "details_en": "The word '기회' (gihoe) means 'opportunity' in Korean. It refers to a favorable time or set of circumstances for achieving something.",
    "details_ko": "단어 '기회'는 한국어로 'opportunity'를 의미합니다. 이는 어떤 일을 성취하기에 좋은 시기나 상황을 뜻합니다."
  },
  {
    "korean": "위험",
    "english": "Danger",
    "details_en": "The word '위험' (wiheom) means 'danger' in Korean. It refers to the possibility of harm or threat.",
    "details_ko": "단어 '위험'은 한국어로 'danger'를 의미합니다. 이는 해를 입거나 위협받을 가능성을 뜻합니다."
  },
  {
    "korean": "안전",
    "english": "Safety",
    "details_en": "The word '안전' (anjeon) means 'safety' in Korean. It signifies the state of being protected from harm.",
    "details_ko": "단어 '안전'은 한국어로 'safety'를 의미합니다. 이는 위험으로부터 보호된 상태를 나타냅니다."
  },
  {
    "korean": "감정",
    "english": "Emotion",
    "details_en": "The word '감정' (gamjeong) means 'emotion' in Korean. It refers to feelings like joy, sadness, anger, and love.",
    "details_ko": "단어 '감정'은 한국어로 'emotion'을 의미합니다. 이는 기쁨, 슬픔, 분노, 사랑 등의 감정을 포함합니다."
  },
  {
    "korean": "슬픔",
    "english": "Sadness",
    "details_en": "The word '슬픔' (seulpeum) means 'sadness' in Korean. It refers to the emotional pain felt during loss or disappointment.",
    "details_ko": "단어 '슬픔'은 한국어로 'sadness'를 의미합니다. 이는 상실이나 실망에서 오는 감정적 고통을 말합니다."
  },
  {
    "korean": "기쁨",
    "english": "Joy",
    "details_en": "The word '기쁨' (gippeum) means 'joy' in Korean. It describes a feeling of great happiness and delight.",
    "details_ko": "단어 '기쁨'은 한국어로 'joy'를 의미합니다. 이는 큰 행복과 기쁨의 감정을 나타냅니다."
  },
  {
    "korean": "분노",
    "english": "Anger",
    "details_en": "The word '분노' (bunno) means 'anger' in Korean. It is an intense emotional reaction to injustice or provocation.",
    "details_ko": "단어 '분노'는 한국어로 'anger'를 의미합니다. 이는 부당함이나 도발에 대한 강한 감정적 반응입니다."
  },
  {
    "korean": "두려움",
    "english": "Fear",
    "details_en": "The word '두려움' (duryeoum) means 'fear' in Korean. It represents an emotional response to perceived threats.",
    "details_ko": "단어 '두려움'은 한국어로 'fear'를 의미합니다. 이는 위협에 대한 감정적 반응을 나타냅니다."
  },
  {
    "korean": "놀람",
    "english": "Surprise",
    "details_en": "The word '놀람' (nollam) means 'surprise' in Korean. It refers to a sudden feeling caused by something unexpected.",
    "details_ko": "단어 '놀람'은 한국어로 'surprise'를 의미합니다. 이는 예상치 못한 일로 인한 갑작스러운 감정을 나타냅니다."
  },
  {
    "korean": "사랑스러움",
    "english": "Loveliness",
    "details_en": "The word '사랑스러움' (sarangseureoum) means 'loveliness' in Korean. It describes something or someone that evokes affection.",
    "details_ko": "단어 '사랑스러움'은 한국어로 'loveliness'를 의미합니다. 이는 사랑을 자아내는 사람이나 사물을 묘사할 때 사용됩니다."
  },
  {
    "korean": "외로움",
    "english": "Loneliness",
    "details_en": "The word '외로움' (oeroum) means 'loneliness' in Korean. It refers to the feeling of being alone or isolated.",
    "details_ko": "단어 '외로움'은 한국어로 'loneliness'를 의미합니다. 이는 혼자 있거나 고립된 느낌을 나타냅니다."
  },
  {
    "korean": "질투",
    "english": "Jealousy",
    "details_en": "The word '질투' (jiltu) means 'jealousy' in Korean. It is the emotion experienced when fearing to lose something valuable to someone else.",
    "details_ko": "단어 '질투'는 한국어로 'jealousy'를 의미합니다. 이는 소중한 것을 다른 사람에게 빼앗길까 봐 느끼는 감정입니다."
  },
  {
    "korean": "자신감",
    "english": "Confidence",
    "details_en": "The word '자신감' (jasingam) means 'confidence' in Korean. It refers to self-assurance and belief in one's abilities.",
    "details_ko": "단어 '자신감'은 한국어로 'confidence'를 의미합니다. 이는 자신의 능력에 대한 확신과 자신감을 뜻합니다."
  },
  {
    "korean": "자존심",
    "english": "Pride",
    "details_en": "The word '자존심' (jajonsim) means 'pride' in Korean. It reflects self-respect or a sense of personal dignity.",
    "details_ko": "단어 '자존심'은 한국어로 'pride'를 의미합니다. 이는 자기 자신에 대한 자부심과 존엄성을 나타냅니다."
  },
  {
    "korean": "용기",
    "english": "Courage",
    "details_en": "The word '용기' (yonggi) means 'courage' in Korean. It refers to the ability to face fear or adversity with strength.",
    "details_ko": "단어 '용기'는 한국어로 'courage'를 의미합니다. 이는 두려움이나 역경을 용감하게 마주하는 능력을 말합니다."
  },
  {
    "korean": "의심",
    "english": "Doubt",
    "details_en": "The word '의심' (uishim) means 'doubt' in Korean. It refers to uncertainty or lack of conviction.",
    "details_ko": "단어 '의심'은 한국어로 'doubt'를 의미합니다. 이는 확신이 없거나 의심스러운 상태를 나타냅니다."
  },
  {
    "korean": "확신",
    "english": "Conviction",
    "details_en": "The word '확신' (hwaksin) means 'conviction' or 'certainty' in Korean. It denotes firm belief in something.",
    "details_ko": "단어 '확신'은 한국어로 'conviction' 또는 'certainty'를 의미합니다. 이는 어떤 것에 대한 굳은 믿음을 말합니다."
  },
  {
    "korean": "기대",
    "english": "Expectation",
    "details_en": "The word '기대' (gidae) means 'expectation' in Korean. It expresses anticipation for a future outcome.",
    "details_ko": "단어 '기대'는 한국어로 'expectation'을 의미합니다. 이는 미래에 대한 희망이나 예상을 나타냅니다."
  },
  {
    "korean": "안도",
    "english": "Relief",
    "details_en": "The word '안도' (ando) means 'relief' in Korean. It is the feeling of comfort after anxiety is lifted.",
    "details_ko": "단어 '안도'는 한국어로 'relief'를 의미합니다. 이는 불안이 해소된 후의 안심된 상태를 말합니다."
  },
  {
    "korean": "혐오",
    "english": "Disgust",
    "details_en": "The word '혐오' (hyeom-o) means 'disgust' in Korean. It denotes strong dislike or aversion.",
    "details_ko": "단어 '혐오'는 한국어로 'disgust'를 의미합니다. 이는 강한 혐오감이나 거부감을 표현합니다."
  },
  {
    "korean": "친절",
    "english": "Kindness",
    "details_en": "The word '친절' (chinjeol) means 'kindness' in Korean. It refers to caring and considerate behavior toward others.",
    "details_ko": "단어 '친절'은 한국어로 'kindness'를 의미합니다. 이는 다른 사람에 대한 배려와 따뜻한 행동을 말합니다."
  },
  {
    "korean": "정직",
    "english": "Honesty",
    "details_en": "The word '정직' (jeongjik) means 'honesty' in Korean. It signifies truthfulness and integrity.",
    "details_ko": "단어 '정직'은 한국어로 'honesty'를 의미합니다. 이는 진실을 말하고 정직하게 행동하는 것을 뜻합니다."
  },
  {
    "korean": "성실",
    "english": "Sincerity",
    "details_en": "The word '성실' (seongsil) means 'sincerity' in Korean. It implies dedication and earnestness in one's actions.",
    "details_ko": "단어 '성실'은 한국어로 'sincerity'를 의미합니다. 이는 진심을 다하고 성실하게 행동하는 태도를 말합니다."
  },
  {
    "korean": "의지",
    "english": "Willpower",
    "details_en": "The word '의지' (uiji) means 'will' or 'willpower' in Korean. It refers to mental strength to pursue goals.",
    "details_ko": "단어 '의지'는 한국어로 'willpower'를 의미합니다. 이는 목표를 향한 정신적 강인함을 뜻합니다."
  },
  {
    "korean": "배려",
    "english": "Consideration",
    "details_en": "The word '배려' (baeryeo) means 'consideration' in Korean. It is the act of being thoughtful of others.",
    "details_ko": "단어 '배려'는 한국어로 'consideration'을 의미합니다. 이는 타인을 배려하고 신경 쓰는 행동을 뜻합니다."
  },
  {
    "korean": "격려",
    "english": "Encouragement",
    "details_en": "The word '격려' (gyeongryeo) means 'encouragement' in Korean. It is the act of giving someone support or confidence.",
    "details_ko": "단어 '격려'는 한국어로 'encouragement'를 의미합니다. 이는 누군가에게 용기나 자신감을 주는 것을 뜻합니다."
  },
  {
    "korean": "인내",
    "english": "Patience",
    "details_en": "The word '인내' (innae) means 'patience' in Korean. It refers to the ability to endure hardship calmly.",
    "details_ko": "단어 '인내'는 한국어로 'patience'를 의미합니다. 이는 어려움을 참고 견디는 능력을 말합니다."
  },
  {
    "korean": "용서",
    "english": "Forgiveness",
    "details_en": "The word '용서' (yongseo) means 'forgiveness' in Korean. It refers to letting go of resentment or blame.",
    "details_ko": "단어 '용서'는 한국어로 'forgiveness'를 의미합니다. 이는 분노나 원망을 내려놓는 것을 말합니다."
  },
  {
    "korean": "행운",
    "english": "Luck",
    "details_en": "The word '행운' (haengun) means 'luck' in Korean. It is the fortune of experiencing favorable outcomes.",
    "details_ko": "단어 '행운'은 한국어로 'luck'을 의미합니다. 이는 좋은 결과를 맞이하는 행운을 뜻합니다."
  },
  {
    "korean": "운명",
    "english": "Fate",
    "details_en": "The word '운명' (unmyeong) means 'fate' in Korean. It describes the destiny or predetermined path in life.",
    "details_ko": "단어 '운명'은 한국어로 'fate'를 의미합니다. 이는 삶에서 정해진 운명이나 숙명을 나타냅니다."
  },
  {
    "korean": "재능",
    "english": "Talent",
    "details_en": "The word '재능' (jaeneung) means 'talent' in Korean. It signifies a natural ability or skill.",
    "details_ko": "단어 '재능'은 한국어로 'talent'를 의미합니다. 이는 타고난 능력이나 재주를 뜻합니다."
  },
  {
    "korean": "기술",
    "english": "Skill",
    "details_en": "The word '기술' (gisul) means 'skill' in Korean. It refers to the ability developed through practice and learning.",
    "details_ko": "단어 '기술'은 한국어로 'skill'을 의미합니다. 이는 연습과 학습을 통해 발전된 능력을 말합니다."
  },
  {
    "korean": "열정",
    "english": "Passion",
    "details_en": "The word '열정' (yeoljeong) means 'passion' in Korean. It is intense enthusiasm or devotion toward something.",
    "details_ko": "단어 '열정'은 한국어로 'passion'을 의미합니다. 이는 어떤 일에 대한 강한 열의나 헌신을 나타냅니다."
  }
]
